rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
/*******************************************************************************
 *
 * Esp32 binary WiFi and BLE driver adapters for LT
 * -----------------------------------------
 *
 * This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0.
 * If a copy of the MPL was not distributed with this file, you can obtain one at
 * https://mozilla.org/MPL/2.0/.
 *
 * Copyright 2026 Roku Inc. All rights reserved.
 *
 ******************************************************************************/

#include <lt/core/LTCore.h>
//#include <lt/utility/byteops/LTUtilityByteOps.h>
#include <lt/device/identity/LTDeviceIdentity.h>
#include <lt/core/LTThread.h>
#include <lt/system/crypto/LTSystemCrypto.h>
#include <lt/core/LTCountingSemaphore.h>
#include <esp32/Esp32_Irq.h>
#include <esp32/Esp32_Registers.h>
#include "Esp32_LTOSAdapter.h"
#include "Esp32_LTOSAdapterOsi.h"
#include "Esp32s3_LTOSAdapter.h"

DEFINE_LTLOG_SECTION("esp32.adpt");

/****************************************************************************
 * Typedefs
 ****************************************************************************/

typedef LT_SIZE size_t;

typedef struct handler_irq_info {
    xt_handler f_user;
    void     * arg;
    int        n;
    void     (*stub)(void);
} handler_irq_info;

/****************************************************************************
 * Macros
 ****************************************************************************/
#undef  va_list
#define va_list                                                     lt_va_list
#undef  va_start
#define va_start                                                    lt_va_start
#undef  va_arg
#define va_arg                                                      lt_va_arg
#undef  va_end
#define va_end                                                      lt_va_end
#undef  va_copy
#define va_copy                                                     lt_va_copy

/* Thread specific clientdata key */
#define ESP_THREAD_SPECIFIC_SEM_KEY                                 "ESPsem"

/* Thread Stack Sizes */
#define THREAD_STACK_SIZE_WIFI_DRIVER                               (5 * 1024)
#define THREAD_STACK_SIZE_WIFI_WORKER                               (2 * 1024)
#define THREAD_STACK_SIZE_WIFI_TIMERS                               (2 * 1024)

/* WiFi memory configurations: minimum memory configuration from IDF */
#define LT_ESP32_WIFI_STATIC_RXBUF_NUM                              4
#define LT_ESP32_WIFI_DYNAMIC_RXBUF_NUM                             8
#define LT_ESP32_WIFI_DYNAMIC_TXBUF_NUM                             8
#if 0 /* Disable AMPDU to save memory: minimum memory configuration from IDF */
#define LT_ESP32_WIFI_TX_AMPDU                                      1
#define LT_ESP32_WIFI_RX_AMPDU                                      1
#endif
#define LT_ESP32_WIFI_RXBA_AMPDU_WZ                                 6

/* DEBUG */
#ifdef LT_DEBUG
#define LT_DEBUG_WIRELESS_ERROR                                     1
#define LT_DEBUG_WIRELESS_WARN                                      1
/* Uncomment this for real debugging */
// #define LT_DEBUG_WIRELESS_INFO                                      1
#else
//#define LT_DEBUG_WIRELESS_ERROR                                     1
#endif

/* Timing definitions */
#define LT_CONFIG_USEC_PER_TICK                                     1000
#define TICK2MSEC(tick)                                             (tick)
#define TICK2USEC(tick)                                             ((tick) * LT_CONFIG_USEC_PER_TICK)
#define USEC2TICK(usec)                                             (((usec)+(LT_CONFIG_USEC_PER_TICK/2))/LT_CONFIG_USEC_PER_TICK)
#define MSEC2TICK(msec)                                             (msec)

/* TODO: check if this is reasonable defaults for LT */
#define ESP32_WIFI_PRIO                                             1
#define SLEEP_MS                                                    1
#define MAC_LEN                                                     6
#define DEFAULT_PS_MODE                                             WIFI_PS_NONE

#if 0 && defined(LT_DEBUG_WIRELESS_INFO) && LT_DEBUG_WIRELESS_INFO
#define LOG_ENTRY() LTLOG_DEBUG("enter", "%s", __FUNCTION__)
#define LOG_LEAVE() LTLOG_DEBUG("enter", "%s", __FUNCTION__)
#define LOG_ENTRY_TIMER(pt)
#define LOG_ENTRY_TIMER_ARM(pt, us, repeat)
#define LOG_TXDONE_ENTRY(...) LTLOG_DEBUG(__VA_ARGS__);
//#define LOG_ENTRY_TIMER(pt) LTLOG_DEBUG("timer", "%s %p", __FUNCTION__, pt)
//#define LOG_ENTRY_TIMER_ARM(pt, us, repeat) LTLOG_DEBUG("timer.arm", "%s %p us %u repeat %d", __FUNCTION__, pt, us, repeat)
#define LOG_ENTRY_TASK(name,stack_depth,prio,handle) LTLOG_DEBUG("enter", "%s: %s stack %d prio %d handle 0x%lx", __FUNCTION__, name, stack_depth, prio, LT_PLT_SIZE(handle))
//#define LOG_ENTRY_MUTEX(handle) LTLOG_DEBUG("enter", "%s: %lx", __FUNCTION__, LT_PLT_SIZE(handle))
#define LOG_ENTRY_MUTEX(handle)
#define LOG_ENTRY_SEM(handle)
//#define LOG_ENTRY_SEM(handle) LTLOG_DEBUG("enter", "%s: %lx", __FUNCTION__, LT_PLT_SIZE(handle))
#define LOG_ENTRY_ISR()
//LTLOG_DEBUG("enter", "%s", __FUNCTION__)
#define LOG_ENTRY_ISR2()
//LTLOG_DEBUG("enter", "%s", __FUNCTION__)
#define LOG_WORKER_ENTRY() LTLOG_DEBUG("enter", "%s", __FUNCTION__)
#define LOG_MUTEX_FAIL() LTLOG_DEBUG("mutex.fail", "%s: FAIL", __FUNCTION__)
//#define LOG_MUTEX_OK() LTLOG_DEBUG("mutex.ok", "%s: OK", __FUNCTION__)
#define LOG_MUTEX_OK()
#define LOG_ENTRY_GET_CURR_TASK()
#define LOG_ENTRY_MSG_WAIT(size) LTLOG_DEBUG("enter", "%s: size %lu", __FUNCTION__,LT_Pu32(size))
#define LOG_MSG_SUCCESS(item,size)
//#define LOG_MSG_SUCCESS(item,size) LTLOG_DEBUG("ok", "%s: msg 0x%lx", __FUNCTION__,LT_Pu32(*((u32*)item)))
#define LOG_MSG_FAIL() LT_ASSERT(0)
#define WIFI_DRIVER_FAIL() LT_ASSERT(0)
#else
#define LOG_ENTRY()
#define LOG_LEAVE()
#define LOG_TXDONE_ENTRY(...)
#define LOG_ENTRY_MUTEX(handle)
#define LOG_MUTEX_FAIL()
#define LOG_MUTEX_OK()
#define LOG_ENTRY_SEM(handle)
#define LOG_ENTRY_TASK(name,stack_depth,prio,handle)
#define LOG_ENTRY_ISR()
#define LOG_ENTRY_ISR2()
#define LOG_ENTRY_TIMER(pt)
#define LOG_ENTRY_TIMER_ARM(pt, us, repeat)
#define LOG_ENTRY_GET_CURR_TASK()
#define LOG_WORKER_ENTRY()
#define LOG_ENTRY_MSG_WAIT(size)
#define LOG_MSG_SUCCESS(item,size)
#define LOG_MSG_FAIL()
#define WIFI_DRIVER_FAIL()
#endif

