rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
#define _VA_LIST_
#define TIMER_INITIALIZED_VAL                                       (0x5aa5a55a)
/* Disable logging from the ROM code. */
#define RTC_DISABLE_ROM_LOG                                         ((1 << 0) | (1 << 16))

/* Sleep and wakeup interval control */
/* Threshold of interval in half slots to allow to fall into sleep mode */
#define LT_ESP32_BTDM_MIN_SLEEP_DURATION                            (24)

/* delay in half slots of modem wake up procedure, including re-enable PHY/RF */
#define LT_ESP32_BTDM_MODEM_WAKE_UP_DELAY                           (8)

#define LT_ESP32_TRACE                                              LTLOG_DEBUG("info", "%s, line#%d", __FUNCTION__, __LINE__)
#define LT_ESP32_SLEEP_MS                                           1

/* Number of fractional bits in values returned by rtc_clk_cal */
#define LT_ESP32_RTC_CLK_CAL_FRACT                                  19

#define LT_ESP32_XTHAL_SET_INTSET(v) \
do {\
  int __interrupt = (int)(v);\
  __asm__ __volatile__("wsr.intset %0" :: "a"(__interrupt):"memory");\
} while(0)

#define RSR(reg, curval)       asm volatile ("rsr %0, " #reg : "=r" (curval));

/* Defs for accessing entropy-related values */
#define CCOUNT                 (234)
#define APB_CYCLE_WAIT_NUM     (16)

/* Main wifi header for binary components */
#include <espidf_wifi.h>
#include <esp_coexist_internal.h>
#define _VA_LIST_DEFINED
#include <esp_bt.h>
#include <esp_system.h>
ESP_EVENT_DEFINE_BASE(WIFI_EVENT);


/* GLOBAL variables */
/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Wi-Fi sleep private data */

u32 g_phy_clk_en_cnt;

/* Reference count of enabling PHY */

uint8_t g_phy_access_ref;

/* Memory to store PHY digital registers */

u32 *g_phy_digital_regs_mem = NULL;

/* Size of that block, from SOC_PHY_DIG_REGS_MEM_SIZE in the IDF soc_caps.h.  It
 * is 21 words on both the esp32 and the esp32s3.  LT has no soc_caps.h.
 */

#define ESP32_PHY_DIG_REGS_MEM_SIZE (21 * 4)

/* Whether g_phy_digital_regs_mem holds a saved copy yet */

static bool g_is_phy_reg_stored = false;

/* Indicate PHY is calibrated or not */

bool g_is_phy_calibrated = false;

/* Wi-Fi feature capacity data */

uint64_t g_wifi_feature_caps = CONFIG_FEATURE_WPA3_SAE_BIT;

/****************************************************************************
 * External functions
 ****************************************************************************/
extern void         btdm_in_wakeup_requesting_set(bool in_wakeup_requesting);
extern void         coex_dbg_set_log_level(int level);
extern int          coex_bt_request(u32 event, u32 latency, u32 duration);
extern int          coex_bt_release(u32 event);
extern int          coex_register_bt_cb(coex_func_cb_t cb);
extern void         coex_bb_reset_unlock(u32 restore);
extern u32          coex_bb_reset_lock(void);
extern int          coex_schm_register_btdm_callback(void *callback);
extern int          coex_wifi_channel_get(uint8_t *primary,
                                   uint8_t *secondary);
extern int          coex_register_wifi_channel_change_callback(void *cb);
extern u8           esp_crc8(u8 const * p, u32 len);
extern void         Esp32_JoinStatus_STA_CB_Success(void);
extern void         Esp32_JoinStatus_STA_CB_Failed(wifi_err_reason_t reason);
extern void         Esp32_ScanResult_STA_CB(unsigned int ap_num, wifi_ap_record_t *ap_list_buffer);
extern esp_err_t    esp_wifi_deinit(void);
extern int          esp_wifi_adapter_init(int *p_wifi_ref_cnt);

/* ESP32 ROM constant, defined in third-party/vendor-sdk/esp-idf-v4.4/components/esp_rom/esp32/ld/esp32.rom.ld */
#if CONFIG_IDF_TARGET_ESP32
extern u32 g_ticks_per_us_pro;
#endif

/*
-------------------------------------------------------------------------------
  Call this function to enable the specified interrupts on the core that runs
  this code.

    mask     - Bit mask of interrupts to be enabled.
-------------------------------------------------------------------------------
*/
extern void         xt_ints_on(uint32_t mask);

/*
-------------------------------------------------------------------------------
  Call this function to disable the specified interrupts on the core that runs
  this code.

    mask     - Bit mask of interrupts to be disabled.
-------------------------------------------------------------------------------
*/
extern void         xt_ints_off(uint32_t mask);


/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void *           esp_spin_lock_create(void);
static void             esp_spin_lock_delete(void *lock);
static u32              esp_wifi_int_disable(void *wifi_int_mux);
static void             esp_wifi_int_restore(void *wifi_int_mux, u32 tmp);
void *                  lt_sem_create(u32 max, u32 init);
void                    lt_sem_delete(void * sem);
s32                     lt_sem_take(void * sem, u32 block_time_tick);
s32                     lt_sem_give(void * sem);
static s32              lt_sem_take_from_isr(void * pSem, void *hptw);
static s32              lt_sem_give_from_isr(void * pSem, void *hptw);
static int              wifi_is_in_isr(void);
static void             lt_timer_disarm(void * timer);
static void             lt_timer_done(void * timer);
static void             lt_timer_setfn(void * timer, void * pfunction, void *parg);
static void             lt_timer_arm_us(void * timer, u32 us, bool repeat);
static void *           lt_malloc_internal(size_t size);
static int64_t          lt_timer_get_time(void);
static void             esp_free(void * ptr);
static void             DispatchAndKillTimer(void * pClientData);
#if CONFIG_IDF_TARGET_ESP32
static xt_handler       esp_ble_set_isr(s32 n, xt_handler f, void *arg) ;
#endif
static void IRAM_ATTR   interrupt_disable(void);
static void IRAM_ATTR   interrupt_restore(void);
static void IRAM_ATTR   lt_task_yield(void);
static void IRAM_ATTR   lt_task_yield_from_isr(void);
static void *           lt_mutex_create(void);
static void             lt_task_delete(void  * task_handle);
static void             lt_mutex_delete(void * pMtx);
static s32              lt_mutex_lock(void   * pMtx);
static s32              lt_mutex_unlock(void * pMtx);
static void *           lt_queue_create(u32 queue_len, u32 item_size);
static void             lt_queue_delete(void * pQueue);
static s32              lt_queue_send(void * pQueue, void *item,
                                      u32 block_time_tick);
static s32              lt_queue_send_from_isr(void * pQueue, void *item, void *hptw);
static s32              lt_queue_send_to_front(void * pQueue, void *item,
                                                u32 block_time_tick);
static s32              lt_queue_recv(void *  pQueue, void *item,
                                        u32 block_time_tick);
static u32              lt_queue_msg_waiting(void * pQueue);
static s32              lt_task_create_pinned_to_core(void * entry,
                                                        const char *name,
                                                        u32    stack_depth,
                                                        void * param,
                                                        u32    prio,
                                                        void * task_handle,
                                                        u32    coreID);
static bool IRAM_ATTR   is_in_isr_wrapper(void);
/* Reached only through g_osi_funcs, so esp32 only. */
#if CONFIG_IDF_TARGET_ESP32
static s32 IRAM_ATTR    cause_sw_intr_to_core_wrapper(s32 coreID, s32 nIntr);
#endif  /* CONFIG_IDF_TARGET_ESP32 */
static void *           esp_malloc(u32 size);
static s32 IRAM_ATTR    read_mac_wrapper(u8 mac[6]);
static void IRAM_ATTR   srand_wrapper(u32 seed);
static s32              lt_rand_stub(void);
#if CONFIG_IDF_TARGET_ESP32
static u32 IRAM_ATTR    btdm_lpcycles_2_us(u32 cycles);
static u32 IRAM_ATTR    btdm_us_2_lpcycles(u32 us);
static bool             btdm_sleep_check_duration(u32 * pSlotCnt);
#endif  /* CONFIG_IDF_TARGET_ESP32 */
bool                    coex_bt_wakeup_request(void);
void                    coex_bt_wakeup_request_end(void);
#if CONFIG_IDF_TARGET_ESP32
static s32 IRAM_ATTR    coex_bt_request_wrapper(u32 event, u32 latency, u32 duration);
static s32              coex_bt_release_wrapper(u32 event);
#endif  /* CONFIG_IDF_TARGET_ESP32 */
static void             esp_ble_helper_handler0(void);
static void             esp_ble_helper_handler1(void);
static void             esp_ble_helper_handler2(void);
static void             esp_ble_helper_handler3(void);
static s32 IRAM_ATTR    queue_recv_from_isr_wrapper(void * pQueue,
                                                    void * pItem,
                                                    void * pHptw);
#if CONFIG_IDF_TARGET_ESP32
static void             xt_ints_on_wrapper(u32 mask);
static s32              coex_register_bt_cb_wrapper(coex_func_cb_t cb);
static s32              coex_schm_register_btdm_callback_wrapper(void *callback);
static s32              coex_wifi_channel_get_wrapper(u8 *primary,
                                                      u8 *secondary);
static s32              coex_register_wifi_channel_change_callback_wrapper(void *cb);
#endif  /* CONFIG_IDF_TARGET_ESP32 */
static s32              lt_task_create(void * entry, const char * name,
                                        u32 stack_depth, void *param,
                                        u32 prio, void * task_handle);
static bool             wifi_env_is_chip(void);
static void             wifi_set_intr(int32_t cpu_no, uint32_t intr_source,
                                         uint32_t intr_num, int32_t intr_prio);
static void             wifi_clear_intr(uint32_t intr_source, uint32_t intr_num);
static void             esp_set_isr(int32_t n, void *f, void *arg);
static void *           esp_thread_semphr_get(void);
static void *           lt_event_group_create(void);
static void             lt_event_group_delete(void *event);
static uint32_t         lt_event_group_set_bits(void *event, uint32_t bits);
static uint32_t         lt_event_group_clear_bits(void *event, uint32_t bits);
static uint32_t         lt_event_group_wait_bits(void *event,
                                                    uint32_t bits_to_wait_for,
                                                    int clear_on_exit,
                                                    int wait_for_all_bits,
                                                    uint32_t block_time_tick);
static void             lt_task_delay(uint32_t tick);
static int32_t          lt_task_ms_to_tick(uint32_t ms);
static void *           lt_task_get_current_task(void);
static int32_t          lt_task_get_max_priority(void);
static int32_t          lt_event_post(esp_event_base_t event_base,
                                        int32_t event_id,
                                        void *event_data,
                                        size_t event_data_size,
                                        uint32_t ticks);
static uint32_t         lt_get_free_heap_size(void);
static void             esp_dport_access_stall_other_cpu_start(void);
static void             esp_dport_access_stall_other_cpu_end(void);
static void             wifi_apb80m_request(void);
static void             wifi_apb80m_release(void);
void             esp32_phy_disable(void);
void             esp32_phy_enable(void);
static void             esp32_phy_enable_clock(void);
static void             esp32_phy_disable_clock(void);
static int              wifi_phy_update_country_info(const char *country);
static int              esp_wifi_read_mac(uint8_t *mac, uint32_t type);
static void             lt_timer_arm(void *timer, uint32_t tmout, bool repeat);
static void             wifi_reset_mac(void);
static void             wifi_clock_enable(void);
static void             wifi_clock_disable(void);
static void             wifi_rtc_enable_iso(void);
static void             wifi_rtc_disable_iso(void);
static int              esp_nvs_set_i8(uint32_t handle, const char *key,
                                        int8_t value);
static int              esp_nvs_get_i8(uint32_t handle, const char *key,
                                        int8_t *out_value);
static int              esp_nvs_set_u8(uint32_t handle, const char *key,
                                        uint8_t value);
static int              esp_nvs_set_u16(uint32_t handle, const char *key,
                                            uint16_t value);
static int              esp_nvs_get_u16(uint32_t handle, const char *key,
                                            uint16_t *out_value);
static int              esp_nvs_open(const char *name, uint32_t open_mode,
                                        uint32_t *out_handle);
static void             esp_nvs_close(uint32_t handle);
static int              esp_nvs_commit(uint32_t handle);
static int              esp_nvs_set_blob(uint32_t handle, const char *key,
                                            const void *value, size_t length);
static int              esp_nvs_get_blob(uint32_t handle, const char *key,
                                            void *out_value, size_t *length);
static int              esp_nvs_erase_key(uint32_t handle, const char *key);
static int              lt_get_random(uint8_t *buf, size_t len);
static int              lt_get_time(void *t);
static void             lt_log_write(uint32_t level,
                                        const char *tag,
                                        const char *format, ...);
static void             lt_log_writev(uint32_t level, const char *tag,
                                        const char *format, va_list args);
static uint32_t         lt_log_timestamp(void);
static void *           lt_realloc_internal(void *ptr, size_t size);
static void *           lt_calloc_internal(size_t n, size_t size);
static void *           lt_zalloc_internal(size_t size);
static void *           lt_wifi_malloc(size_t size);
static void *           lt_wifi_realloc(void *ptr, size_t size);
static void *           lt_wifi_calloc(size_t n, size_t size);
static void *           lt_wifi_zalloc(size_t size);
static void *           lt_wifi_create_queue(int queue_len, int item_size);
static void             lt_wifi_delete_queue(void * pQueue);
static int              wifi_coex_init(void);
static void             wifi_coex_deinit(void);
static int              wifi_coex_enable(void);
static void             wifi_coex_disable(void);
static uint32_t         esp_coex_status_get(void);
static void             esp_coex_condition_set(uint32_t type, bool dissatisfy);
static int              esp_coex_wifi_request(uint32_t event, uint32_t latency,
                                                uint32_t duration);
static int              esp_coex_wifi_release(uint32_t event);
static int              wifi_coex_wifi_set_channel(uint8_t primary, uint8_t secondary);
static int              wifi_coex_get_event_duration(uint32_t event,
                                                        uint32_t *duration);
static int              wifi_coex_get_pti(uint32_t event, uint8_t *pti);
static void             wifi_coex_clear_schm_status_bit(uint32_t type,
                                                        uint32_t status);
static void             wifi_coex_set_schm_status_bit(uint32_t type,
                                                        uint32_t status);
static int              wifi_coex_set_schm_interval(uint32_t interval);
static uint32_t         wifi_coex_get_schm_interval(void);
static uint8_t          wifi_coex_get_schm_curr_period(void);
static void *           wifi_coex_get_schm_curr_phase(void);
static int              wifi_coex_set_schm_curr_phase_idx(int idx);
static int              wifi_coex_get_schm_curr_phase_idx(void);
static void *           esp_wifi_malloc(unsigned int size);
static int              esp_event_id_map(int event_id);
static int              esp_nvs_get_u8(uint32_t handle, const char *key,
                                        uint8_t *out_value);
static void             esp_evt_work_cb(void * data);
static void             esp_evt_work_complete_cb(LTThread_ReleaseReason, void * data);
static inline void      phy_digital_regs_load(void);
static inline void      phy_digital_regs_store(void);

