rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
/*
 * Radio clock gate, implemented in the per chip BSP because the register moved
 * from DPORT to APB_CTRL on the esp32s3 while this file is built against the
 * esp32 register map for both parts.  Declared here rather than by including
 * Esp32_Clock.h, which would drag in the other part's register map.
 */
void                    Esp32_ClockEnableRadioCommonClock(void);
void                    Esp32_ClockDisableRadioCommonClock(void);

static void FreeHandleList(LTList *handleList);

/****************************************************************************
 * Static variables
 ****************************************************************************/

static volatile u32           g_nLastCycleCount     = 0;
static LT_SIZE                disableMask           = 0;
static u32                    disableCount          = 0;
static LTThread               g_hThread_wifi_wrk    = 0;
static LTThread               g_hThread_wifi_drv    = 0;
static LTThread               g_hThread_wifi_timers = 0;
static LTList                 g_threads;
static LTList                 g_timers;

static handler_irq_info g_irq_info[] = {
    {
        NULL,
        NULL,
        -1,
        esp_ble_helper_handler0
    },
    {
        NULL,
        NULL,
        -1,
        esp_ble_helper_handler1
    },
    {
        NULL,
        NULL,
        -1,
        esp_ble_helper_handler2
    },
    {
        NULL,
        NULL,
        -1,
        esp_ble_helper_handler3
    }
};


static int g_num_irq = sizeof(g_irq_info) / sizeof(g_irq_info[0]);

/* The esp32 BLE controller's low power clock period, in micro seconds and in
 * the fixed point the second value counts fractional bits of.  Both are read
 * only by the btdm_*_lpcycles converters in g_osi_funcs; the esp32s3 controller
 * keeps its own pair in Esp32s3DriverBleController.c. */

#if CONFIG_IDF_TARGET_ESP32
static const DRAM_ATTR u8 g_btdm_lpcycle_us_frac = LT_ESP32_RTC_CLK_CAL_FRACT;
static const DRAM_ATTR u32 g_btdm_lpcycle_us = 2 << (g_btdm_lpcycle_us_frac);
#endif  /* CONFIG_IDF_TARGET_ESP32 */

static u8 wifi_mac_address[6] = {0};

/****************************************************************************
 * Enums
 ****************************************************************************/

enum esp_bt_coex_log_level
{
    ESP_BT_COEX_LOG_LEVEL_NONE = 0,
    ESP_BT_COEX_LOG_LEVEL_ERROR,
    ESP_BT_COEX_LOG_LEVEL_WARNING,
    ESP_BT_COEX_LOG_LEVEL_INFO,
    ESP_BT_COEX_LOG_LEVEL_DEBUG,
    ESP_BT_COEX_LOG_LEVEL_VERBOSE
};

enum wifi_adpt_evt_e
{
    WIFI_ADPT_EVT_SCAN_DONE = 0,
    WIFI_ADPT_EVT_STA_START,
    WIFI_ADPT_EVT_STA_CONNECT,
    WIFI_ADPT_EVT_STA_DISCONNECT,
    WIFI_ADPT_EVT_STA_AUTHMODE_CHANGE,
    WIFI_ADPT_EVT_STA_STOP,
    WIFI_ADPT_EVT_STA_BEACON_TIMEOUT,
    WIFI_ADPT_EVT_MAX,
};

enum esp32_rtc_xtal_freq_e {
    RTC_XTAL_FREQ_AUTO = 0,     /* Automatic XTAL frequency detection */
    RTC_XTAL_FREQ_40M = 40,     /* 40 MHz XTAL */
    RTC_XTAL_FREQ_26M = 26,     /* 26 MHz XTAL */
    RTC_XTAL_FREQ_24M = 24,     /* 24 MHz XTAL */
};

enum esp32_rtc_xtal_freq_e rtc_get_xtal(void)
__attribute__((alias("esp32_rtc_clk_xtal_freq_get")));



/****************************************************************************
 * Structures
 ****************************************************************************/

/* Wi-Fi event private data */

struct evt_adpt
{
  s32 id;               /* Event ID */
  u8 buf[0];           /* Event private data */
};

/* Wi-Fi time private data */
struct time_adpt {
    time_t      sec;          /* Second value */
    suseconds_t usec;         /* Micro second value */
};

coex_adapter_funcs_t g_coex_adapter_funcs = {
    ._version = COEX_ADAPTER_VERSION,
#if CONFIG_IDF_TARGET_ESP32
    ._spin_lock_create = esp_spin_lock_create,
    ._spin_lock_delete = esp_spin_lock_delete,
    ._int_enable = esp_wifi_int_restore,
    ._int_disable = esp_wifi_int_disable,
#endif
    ._task_yield_from_isr = lt_task_yield_from_isr,
    ._semphr_create = lt_sem_create,
    ._semphr_delete = lt_sem_delete,
    ._semphr_take_from_isr = lt_sem_take_from_isr,
    ._semphr_give_from_isr = lt_sem_give_from_isr,
    ._semphr_take = lt_sem_take,
    ._semphr_give = lt_sem_give,
    ._is_in_isr = wifi_is_in_isr,
    ._malloc_internal =  lt_malloc_internal,
    ._free = esp_free,
#if CONFIG_IDF_TARGET_ESP32
    /* The esp32s3 coex blob drives its timers through esp_timer instead. */
    ._timer_disarm = lt_timer_disarm,
    ._timer_done = lt_timer_done,
    ._timer_setfn = lt_timer_setfn,
    ._timer_arm_us = lt_timer_arm_us,
#endif
    ._esp_timer_get_time = lt_timer_get_time,
    ._magic = COEX_ADAPTER_MAGIC,
};

/* The esp32 BLE controller's OSI table.  Esp32DriverBleController.c registers
 * it; the esp32s3 controller has its own in Esp32s3DriverBleController.c,
 * assembled from the same primitives but with a different layout and its own
 * dynamic interrupt line allocation. */

#if CONFIG_IDF_TARGET_ESP32

const struct osi_funcs_t g_osi_funcs = {
  ._magic                                      = OSI_MAGIC_VALUE,
  ._version                                    = OSI_VERSION,
  ._set_isr                                    = esp_ble_set_isr,
  ._ints_on                                    = xt_ints_on_wrapper,
  ._interrupt_disable                          = interrupt_disable,
  ._interrupt_restore                          = interrupt_restore,
  ._task_yield                                 = lt_task_yield,
  ._task_yield_from_isr                        = lt_task_yield_from_isr,
  ._semphr_create                              = lt_sem_create,
  ._semphr_delete                              = lt_sem_delete,
  ._semphr_take_from_isr                       = lt_sem_take_from_isr,
  ._semphr_give_from_isr                       = lt_sem_give_from_isr,
  ._semphr_take                                = lt_sem_take,
  ._semphr_give                                = lt_sem_give,
  ._mutex_create                               = lt_mutex_create,
  ._mutex_delete                               = lt_mutex_delete,
  ._mutex_lock                                 = lt_mutex_lock,
  ._mutex_unlock                               = lt_mutex_unlock,
  ._queue_create                               = lt_queue_create,
  ._queue_delete                               = lt_queue_delete,
  ._queue_send                                 = lt_queue_send,
  ._queue_send_from_isr                        = lt_queue_send_from_isr,
  ._queue_recv                                 = lt_queue_recv,
  ._queue_recv_from_isr                        = queue_recv_from_isr_wrapper,
  ._task_create                                = lt_task_create_pinned_to_core,
  ._task_delete                                = lt_task_delete,
  ._is_in_isr                                  = is_in_isr_wrapper,
  ._cause_sw_intr_to_core                      = cause_sw_intr_to_core_wrapper,
  ._malloc                                     = esp_malloc,
  ._malloc_internal                            = esp_malloc,
  ._free                                       = esp_free,
  ._read_efuse_mac                             = read_mac_wrapper,
  ._srand                                      = srand_wrapper,
  ._rand                                       = lt_rand_stub,
  ._btdm_lpcycles_2_us                         = btdm_lpcycles_2_us,
  ._btdm_us_2_lpcycles                         = btdm_us_2_lpcycles,
  ._btdm_sleep_check_duration                  = btdm_sleep_check_duration,
  ._coex_bt_wakeup_request                     = coex_bt_wakeup_request,
  ._coex_bt_wakeup_request_end                 = coex_bt_wakeup_request_end,
  ._coex_bt_request                            = coex_bt_request_wrapper,
  ._coex_bt_release                            = coex_bt_release_wrapper,
  ._coex_register_bt_cb                        = coex_register_bt_cb_wrapper,
  ._coex_bb_reset_lock                         = coex_bb_reset_lock,
  ._coex_bb_reset_unlock                       = coex_bb_reset_unlock,
  ._coex_schm_register_btdm_callback           = coex_schm_register_btdm_callback_wrapper,
  ._coex_schm_status_bit_clear                 = coex_schm_status_bit_clear,
  ._coex_schm_status_bit_set                   = coex_schm_status_bit_set,
  ._coex_schm_interval_get                     = coex_schm_interval_get,
  ._coex_schm_curr_period_get                  = coex_schm_curr_period_get,
  ._coex_schm_curr_phase_get                   = coex_schm_curr_phase_get,
  ._coex_wifi_channel_get                      = coex_wifi_channel_get_wrapper,
  ._coex_register_wifi_channel_change_callback = coex_register_wifi_channel_change_callback_wrapper,
};
#endif  /* CONFIG_IDF_TARGET_ESP32 */

