rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
/* Wi-Fi OS adapter data */
/* NOTE: non-static here to match the vendor header, also probably used directly by binaries */
wifi_osi_funcs_t g_wifi_osi_funcs = {
    ._version = ESP_WIFI_OS_ADAPTER_VERSION,
    ._env_is_chip = wifi_env_is_chip,
    ._set_intr = wifi_set_intr,
    ._clear_intr = wifi_clear_intr,
    ._set_isr = esp_set_isr,
    ._ints_on = xt_ints_on,
    ._ints_off = xt_ints_off,
    ._is_from_isr = is_in_isr_wrapper,
    ._spin_lock_create = esp_spin_lock_create,
    ._spin_lock_delete = esp_spin_lock_delete,
    ._wifi_int_disable = esp_wifi_int_disable,
    ._wifi_int_restore = esp_wifi_int_restore,
    ._task_yield_from_isr = lt_task_yield_from_isr,
    ._semphr_create = lt_sem_create,
    ._semphr_delete = lt_sem_delete,
    ._semphr_take = lt_sem_take,
    ._semphr_give = lt_sem_give,
    ._wifi_thread_semphr_get = esp_thread_semphr_get,
    ._mutex_create = lt_mutex_create,
    ._recursive_mutex_create = lt_mutex_create,
    ._mutex_delete = lt_mutex_delete,
    ._mutex_lock = lt_mutex_lock,
    ._mutex_unlock = lt_mutex_unlock,
    ._queue_create = lt_queue_create,
    ._queue_delete = lt_queue_delete,
    ._queue_send = lt_queue_send,
    ._queue_send_from_isr = lt_queue_send_from_isr,
    ._queue_send_to_back = lt_queue_send,
    ._queue_send_to_front = lt_queue_send_to_front,
    ._queue_recv = lt_queue_recv,
    ._queue_msg_waiting = lt_queue_msg_waiting,
    ._event_group_create = lt_event_group_create,
    ._event_group_delete = lt_event_group_delete,
    ._event_group_set_bits = lt_event_group_set_bits,
    ._event_group_clear_bits = lt_event_group_clear_bits,
    ._event_group_wait_bits = lt_event_group_wait_bits,
    ._task_create_pinned_to_core = lt_task_create_pinned_to_core,
    ._task_create = lt_task_create,
    ._task_delete = lt_task_delete,
    ._task_delay = lt_task_delay,
    ._task_ms_to_tick = lt_task_ms_to_tick,
    ._task_get_current_task = lt_task_get_current_task,
    ._task_get_max_priority = lt_task_get_max_priority,
    ._malloc = esp_wifi_malloc,
    ._free = esp_free,
    ._event_post = lt_event_post,
    ._get_free_heap_size = lt_get_free_heap_size,
    ._rand = (uint32_t (*)(void))lt_rand_stub,
    ._dport_access_stall_other_cpu_start_wrap =
    esp_dport_access_stall_other_cpu_start,
    ._dport_access_stall_other_cpu_end_wrap =
    esp_dport_access_stall_other_cpu_end,
    ._wifi_apb80m_request = wifi_apb80m_request,
    ._wifi_apb80m_release = wifi_apb80m_release,
    ._phy_disable = esp32_phy_disable,
    ._phy_enable = esp32_phy_enable,
#if CONFIG_IDF_TARGET_ESP32
    /* The esp32s3 folds the common clock into _phy_enable/_disable. */
    ._phy_common_clock_enable = esp32_phy_enable_clock,
    ._phy_common_clock_disable = esp32_phy_disable_clock,
#endif
    ._phy_update_country_info = wifi_phy_update_country_info,
    ._read_mac = esp_wifi_read_mac,
    ._timer_arm = lt_timer_arm,
    ._timer_disarm = lt_timer_disarm,
    ._timer_done = lt_timer_done,
    ._timer_setfn = lt_timer_setfn,
    ._timer_arm_us = lt_timer_arm_us,
    ._wifi_reset_mac = wifi_reset_mac,
    ._wifi_clock_enable = wifi_clock_enable,
    ._wifi_clock_disable = wifi_clock_disable,
    ._wifi_rtc_enable_iso = wifi_rtc_enable_iso,
    ._wifi_rtc_disable_iso = wifi_rtc_disable_iso,
    ._esp_timer_get_time = lt_timer_get_time,
    ._nvs_set_i8 = esp_nvs_set_i8,
    ._nvs_get_i8 = esp_nvs_get_i8,
    ._nvs_set_u8 = esp_nvs_set_u8,
    ._nvs_get_u8 = esp_nvs_get_u8,
    ._nvs_set_u16 = esp_nvs_set_u16,
    ._nvs_get_u16 = esp_nvs_get_u16,
    ._nvs_open = esp_nvs_open,
    ._nvs_close = esp_nvs_close,
    ._nvs_commit = esp_nvs_commit,
    ._nvs_set_blob = esp_nvs_set_blob,
    ._nvs_get_blob = esp_nvs_get_blob,
    ._nvs_erase_key = esp_nvs_erase_key,
    ._get_random = lt_get_random,
    ._get_time = lt_get_time,
    ._random = (long unsigned int (*)(void))lt_rand_stub,
#if !CONFIG_IDF_TARGET_ESP32
    ._slowclk_cal_get = Esp32s3_SlowClkCalGet,
#endif
    ._log_write = lt_log_write,
    ._log_writev = lt_log_writev,
    ._log_timestamp = lt_log_timestamp,
    ._malloc_internal =  lt_malloc_internal,
    ._realloc_internal = lt_realloc_internal,
    ._calloc_internal = lt_calloc_internal,
    ._zalloc_internal = lt_zalloc_internal,
    ._wifi_malloc = lt_wifi_malloc,
    ._wifi_realloc = lt_wifi_realloc,
    ._wifi_calloc = lt_wifi_calloc,
    ._wifi_zalloc = lt_wifi_zalloc,
    ._wifi_create_queue = lt_wifi_create_queue,
    ._wifi_delete_queue = lt_wifi_delete_queue,
    ._coex_init = wifi_coex_init,
    ._coex_deinit = wifi_coex_deinit,
    ._coex_enable = wifi_coex_enable,
    ._coex_disable = wifi_coex_disable,
    ._coex_status_get = esp_coex_status_get,
    ._coex_condition_set = esp_coex_condition_set,
    ._coex_wifi_request = esp_coex_wifi_request,
    ._coex_wifi_release = esp_coex_wifi_release,
    ._coex_wifi_channel_set = wifi_coex_wifi_set_channel,
    ._coex_event_duration_get = wifi_coex_get_event_duration,
    ._coex_pti_get = wifi_coex_get_pti,
    ._coex_schm_status_bit_clear = wifi_coex_clear_schm_status_bit,
    ._coex_schm_status_bit_set = wifi_coex_set_schm_status_bit,
    ._coex_schm_interval_set = wifi_coex_set_schm_interval,
    ._coex_schm_interval_get = wifi_coex_get_schm_interval,
    ._coex_schm_curr_period_get = wifi_coex_get_schm_curr_period,
    ._coex_schm_curr_phase_get = wifi_coex_get_schm_curr_phase,
    ._coex_schm_curr_phase_idx_set = wifi_coex_set_schm_curr_phase_idx,
    ._coex_schm_curr_phase_idx_get = wifi_coex_get_schm_curr_phase_idx,
    ._magic = ESP_WIFI_OS_ADAPTER_MAGIC,
};

/****************************************************************************
 * static library, interface pointers, and initialization thereof
 ****************************************************************************/
static LTAtomic              s_referenceCount       = { 0 };
static LTCore               *s_core                 = NULL;
static ILTThread            *s_iThread              = NULL;
static LTMutex              *s_mutex_WiFiApi        = NULL;

/* Serialises esp32_phy_enable()/esp32_phy_disable().  IDF guards the same pair
 * with a mutex, not a critical section: the region runs a full RF calibration.
 */
static LTMutex              *s_mutex_Phy            = NULL;

