rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
typedef struct {
    LTList_Node node;
    LTHandle    handle;
} HandleListNode;

typedef struct ESP32AdapterQueue {
    LTList queuedNodes;
    LTList freeNodes;
    u32 queueLen;
    u32 itemSize;
} ESP32AdapterQueue;

LT_STATIC_ASSERT_SIZE_32_64(ESP32AdapterQueue, 24, 56);
LT_STATIC_ASSERT_SIZE_32_64(LTList_Node, 8, 16);
#define QUEUE_IS_FULL_SLEEP_TIME LTTime_Milliseconds(1)

// See LT-1252 regarding these locks
#ifdef DISABLE_WIFIAPI_LOCKS
#define LOCK_WIFIAPI()
#define UNLOCK_WIFIAPI()
#else
#define LOCK_WIFIAPI()   s_mutex_WiFiApi->API->Lock(s_mutex_WiFiApi)
#define UNLOCK_WIFIAPI() s_mutex_WiFiApi->API->Unlock(s_mutex_WiFiApi)
#endif

static LTTime TicksToAbsTime(u32 ticks) {
    if (ticks == 0)          return LTTime_Zero();
    if (ticks == 0xFFFFFFFF) return LTTime_Infinite();
    return LTTime_Add(s_core->GetKernelTime(), LTTime_Milliseconds(TICK2MSEC(ticks)));
}

/******************************************************************************/
// LT-1211: Track the last few WiFiApi mutex locks. Whenever a TryLock fails to
// get the lock, dump the tracking info to the log. Within the log line, the
// negative line number is the call that failed. This format is intentionally
// kept minimal to allow it to be stored across a crash.

typedef struct {
    LTThread thread; // thread that wants the lock
    s16      line;   // line number in Esp32DriverWiFi.c
} MutexTrack;
static MutexTrack s_Tracks[8] = {};
static LTAtomic   s_TrackIndex;

static char *GetThreadName(LTThread thread) {
    static char name[kLTThread_MaxNameBuff];
    s_iThread->GetName(thread, name);
    name[5] = 0;
    return name;
}

void LTEsp32OSAdapter_LockWiFiApi(int line) {
    // Do not lock the s_hMutex_WiFiApi on the wifi driver thread.
    // It can deadlock when calling LOCK_WIFIAPI() via a callback
    if (s_iThread->GetCurrentThread() == g_hThread_wifi_drv) return;

    // Track the last N lock locations; log lock conflict
    u16 index = LTAtomic_FetchAdd(&s_TrackIndex, 1);
    u16 i = index & 7;
    s_Tracks[i].line  = line;
    s_Tracks[i].thread = s_iThread->GetCurrentThread();
    bool okay = s_mutex_WiFiApi->API->TryLock(s_mutex_WiFiApi);
    if (!okay) {  // debug: || i == 7
        s_Tracks[i].line = -s_Tracks[i].line; // marks lock that failed
        char (*name)[8][6] = lt_malloc(sizeof(*name));
        lt_strncpyTerm((*name)[0], GetThreadName(s_Tracks[0].thread), 6);
        lt_strncpyTerm((*name)[1], GetThreadName(s_Tracks[1].thread), 6);
        lt_strncpyTerm((*name)[2], GetThreadName(s_Tracks[2].thread), 6);
        lt_strncpyTerm((*name)[3], GetThreadName(s_Tracks[3].thread), 6);
        lt_strncpyTerm((*name)[4], GetThreadName(s_Tracks[4].thread), 6);
        lt_strncpyTerm((*name)[5], GetThreadName(s_Tracks[5].thread), 6);
        lt_strncpyTerm((*name)[6], GetThreadName(s_Tracks[6].thread), 6);
        lt_strncpyTerm((*name)[7], GetThreadName(s_Tracks[7].thread), 6);
        LTLOG("trk", "%s:%d %s:%d %s:%d %s:%d %s:%d %s:%d %s:%d %s:%d",
            (*name)[0], s_Tracks[0].line,
            (*name)[1], s_Tracks[1].line,
            (*name)[2], s_Tracks[2].line,
            (*name)[3], s_Tracks[3].line,
            (*name)[4], s_Tracks[4].line,
            (*name)[5], s_Tracks[5].line,
            (*name)[6], s_Tracks[6].line,
            (*name)[7], s_Tracks[7].line
        );
        lt_free(name);
        s_mutex_WiFiApi->API->Lock(s_mutex_WiFiApi); // debug: if (!okay)
    }
}

void LTEsp32OSAdapter_UnlockWiFiApi(void) {
    if (s_iThread->GetCurrentThread() == g_hThread_wifi_drv) return;
    s_mutex_WiFiApi->API->Unlock(s_mutex_WiFiApi);
}

void LTEsp32OSAdapter_LibInit(void) {
    if (LTAtomic_FetchAdd(&s_referenceCount, 1) == 0) {
        s_core = LT_GetCore();
        s_mutex_WiFiApi = lt_createobject(LTMutex);
        s_mutex_Phy     = lt_createobject(LTMutex);
        s_iThread = lt_getlibraryinterface(ILTThread, s_core);
        LTList_Init(&g_threads);
        LTList_Init(&g_timers);
    }
}


void LTEsp32OSAdapter_LibFini(void) {
    if (LTAtomic_FetchSubtract(&s_referenceCount, 1) == 1) {
        FreeHandleList(&g_threads);
        lt_destroyobject(s_mutex_WiFiApi);
        lt_destroyobject(s_mutex_Phy);
        s_mutex_WiFiApi = NULL;
        s_mutex_Phy     = NULL;
        s_iThread = NULL;
        s_core    = NULL;
    }
}

/****************************************************************************
 * Definitions of static functions
 ****************************************************************************/

static bool AddHandleToList(LTList *list, LTHandle handle) {
    HandleListNode *node = lt_malloc(sizeof(HandleListNode));
    if (!node) return false;
    node->handle = handle;
    LTList_AddTail(list, &node->node);
    return true;
}

static void FreeHandleList(LTList *list) {
    LTList_ForEach(pNode, list) {
        HandleListNode *objectNode = LT_CONTAINER_OF(pNode, HandleListNode, node);
        s_core->DestroyHandle(objectNode->handle);
        lt_free(objectNode);
    }
    LTList_EndForEach;
    LTList_Init(list);
}

/****************************************************************************
 * Name: esp_wifi_int_disable
 *
 * Description:
 *   Enter critical section by disabling interrupts and taking the spin lock
 *   if in SMP mode.
 *
 * Input Parameters:
 *   wifi_int_mux - Spin lock data pointer
 *
 * Returned Value:
 *   CPU PS value.
 *
 ****************************************************************************/

static u32 IRAM_ATTR esp_wifi_int_disable(void * wifi_int_mux)
{
    LOG_ENTRY_ISR();
#ifdef LT_HAS_SMP
    /* Create a real spinlock */
    LT_ASSERT(0);
#else
    LT_UNUSED(wifi_int_mux);
    return (u32)s_core->Disable();
#endif
}

/****************************************************************************
 * Name: esp_spin_lock_create
 *
 * Description:
 *   Create spin lock in SMP mode
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Spin lock data pointer
 *
 ****************************************************************************/

static void *esp_spin_lock_create(void)
{
    LOG_ENTRY();
#ifdef LT_HAS_SMP
    /* Create a real spinlock */
    LT_ASSERT(0);
#else
    /* If return NULL, code may check fail  */
    return (void *)1;
#endif
}

/****************************************************************************
 * Name: esp_spin_lock_delete
 *
 * Description:
 *   Delete spin lock
 *
 * Input Parameters:
 *   lock - Spin lock data pointer
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp_spin_lock_delete(void *lock)
{
    LOG_ENTRY();
    LT_UNUSED(lock);
#ifdef LT_HAS_SMP
    /* Create a real spinlock */
    LT_ASSERT(0);
#else
    LT_ASSERT((int)lock == 1);
#endif
}

/****************************************************************************
 * Name: esp_wifi_int_restore
 *
 * Description:
 *   Exit from critical section by enabling interrupts and releasing the spin
 *   lock if in SMP mode.
 *
 * Input Parameters:
 *   wifi_int_mux - Spin lock data pointer
 *   tmp          - CPU PS value.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

