rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
static void IRAM_ATTR esp_wifi_int_restore(void *wifi_int_mux, u32 tmp)
{
    LOG_ENTRY_ISR();
#ifdef LT_HAS_SMP
    /* Create a real spinlock */
    LT_ASSERT(0);
#else
    LT_UNUSED(wifi_int_mux);
    s_core->Enable(tmp);
#endif
}

/****************************************************************************/
/* Create counting semaphore                                                */
/****************************************************************************/
void * lt_sem_create(u32 max, u32 init)
{
    LT_ASSERT(init <= max);
    LTCountingSemaphore *sem = lt_createobject(LTCountingSemaphore);
    if (!sem) return NULL;
    sem->API->Init(sem, max, init);
    LOG_ENTRY_SEM(sem);
    return (void *)sem;
}

/****************************************************************************/
/* Delete counting semaphore                                                */
/****************************************************************************/
void lt_sem_delete(void * pSem)
{
    LOG_ENTRY_SEM(pSem);
    if (pSem) lt_destroyobject((LTCountingSemaphore *)pSem);
}

/****************************************************************************/
/* Take counting semaphore                                                  */
/****************************************************************************/
static s32 lt_sem_take_from_isr(void *pSem, void *hptw)
{
    if (pSem == NULL) return false;
    *(int *)hptw = 0;
    LTCountingSemaphore *sem = (LTCountingSemaphore *)pSem;
    return sem->API->TryWait(sem) ? true : false;
}

s32 lt_sem_take(void * pSem, u32 block_ticks)
{
    if (!pSem) return false;
    LTCountingSemaphore *sem = (LTCountingSemaphore *)pSem;
    LTTime timeout;
    if (block_ticks == 0)          timeout = LTTime_Zero();
    else if (block_ticks == 0xFFFFFFFF) timeout = LTTime_Infinite();
    else                           timeout = LTTime_Milliseconds(TICK2MSEC(block_ticks));
    return sem->API->Wait(sem, timeout) ? true : false;
}

/****************************************************************************/
/* Give counting semaphore                                                  */
/****************************************************************************/
static s32 lt_sem_give_from_isr(void *pSem, void *hptw) LT_ISR_SAFE
{
    if (pSem == NULL) return false;
    *(int *)hptw = 0;
    LTCountingSemaphore *sem = (LTCountingSemaphore *)pSem;
    sem->API->Signal(sem);
    return true;
}

s32 lt_sem_give(void * pSem)
{
    if (!pSem) return false;
    LTCountingSemaphore *sem = (LTCountingSemaphore *)pSem;
    sem->API->SignalFromThread(sem);
    return true;
}

static int wifi_is_in_isr(void)
{
    return is_in_isr_wrapper();
}

#define WIFI_RX_BUFFER_SIZE 1696 /* WiFi allocates memory for RX ring buffers */
#define MAX_FRAMES (LT_ESP32_WIFI_DYNAMIC_RXBUF_NUM)
static char s_packpool[MAX_FRAMES*WIFI_RX_BUFFER_SIZE];
static LTAtomic s_freemask = { ((1 << MAX_FRAMES) - 1) };
#define ADDR_IN_POOL(addr) ((((char * )(addr)) >= s_packpool) && (((char * )(addr)) < (s_packpool+sizeof(s_packpool))))

static void *lt_pool_alloc(size_t size)
{
    if (size == WIFI_RX_BUFFER_SIZE) {
        for(u32 i=0; i<MAX_FRAMES; i++) {
            u32 msk = LTAtomic_Load(&s_freemask);
            while (msk & (1 << i)) {
                if (LTAtomic_CompareAndExchange(&s_freemask, msk, msk & ~(1 << i))) {
                    return (s_packpool+i*(WIFI_RX_BUFFER_SIZE));
                }
                msk = LTAtomic_Load(&s_freemask);
            }
        }
    }
    return NULL;
}

static void lt_pool_free(void *ptr)
{
    u32 i = ((u32)ptr - (u32)s_packpool)/WIFI_RX_BUFFER_SIZE;
    u32 msk = LTAtomic_Load(&s_freemask);
    while(!(msk & (1 << i))) {
        if (LTAtomic_CompareAndExchange(&s_freemask, msk, msk | (1 << i))) {
            return;
        } else {
            msk = LTAtomic_Load(&s_freemask);
        }
    }
    LT_ASSERT(0 && "Double free");
}
/****************************************************************************
 * Name: lt_malloc_internal
 *
 * Description:
 *   Drivers allocate a block of memory
 *
 * Input Parameters:
 *   size - memory size
 *
 * Returned Value:
 *   Memory pointer
 *
 ****************************************************************************/

static void *lt_malloc_internal(size_t size)
{
    LOG_ENTRY();
    return lt_malloc(size);
}

/****************************************************************************
 * Name: esp_free
 *
 * Description:
 *   Free a block of memory
 *
 * Input Parameters:
 *   ptr - memory block
 *
 * Returned Value:
 *   No
 *
 ****************************************************************************/

static void esp_free(void *ptr)
{
    if (ADDR_IN_POOL(ptr)) {
        lt_pool_free(ptr);
    } else {
        lt_free(ptr);
    }
}

/****************************************************************************
 * Name: lt_timer_disarm
 *
 * Description:
 *   Disable timer
 *
 * Input Parameters:
 *   ptimer - timer data pointer
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void KillZombieTimers(void *data)
{
    LT_UNUSED(data);
    LTList_ForEach(pNode, &g_timers) {
        timerData_t *pTimerData = LT_CONTAINER_OF(pNode, timerData_t, node);
        if (LTAtomic_CompareAndExchange(&pTimerData->timerState, kTimerZombie, kTimerStopped)) {
            s_iThread->KillTimer(g_hThread_wifi_timers, DispatchAndKillTimer, pTimerData);
        }
    } LTList_EndForEach;
}

static void lt_timer_disarm(void *ptimer) LT_ISR_SAFE
{
    struct ets_timer *ets_timer = (struct ets_timer *)ptimer;
    timerData_t * pTimerData = (timerData_t *)ets_timer->priv;
    LOG_ENTRY_TIMER(ptimer);
    if (ets_timer->expire == TIMER_INITIALIZED_VAL) {
        if (!s_core->InsideInterruptContext() && s_iThread->IsCurrentThread(g_hThread_wifi_timers)) {
            if (LTAtomic_CompareAndExchange(&pTimerData->timerState, kTimerRunning, kTimerStopped)) {
                s_iThread->KillTimer(g_hThread_wifi_timers, DispatchAndKillTimer, pTimerData);
            }
        } else if (LTAtomic_CompareAndExchange(&pTimerData->timerState, kTimerRunning, kTimerZombie)) {
            s_iThread->QueueTaskProcIfRequired(g_hThread_wifi_timers, KillZombieTimers, NULL, NULL);
        }
    }
}

/****************************************************************************
 * Name: lt_timer_done
 *
 * Description:
 *   Disable and free timer
 *
 * Input Parameters:
 *   ptimer - timer data pointer
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lt_timer_done(void *ptimer)
{
    struct ets_timer *ets_timer = (struct ets_timer *)ptimer;
    timerData_t * pTimerData = (timerData_t *)ets_timer->priv;
    LOG_ENTRY_TIMER(ptimer);
    if (ets_timer->expire == TIMER_INITIALIZED_VAL) {
        lt_timer_disarm(ptimer);
        ets_timer->expire = 0;
        LTList_Remove(&pTimerData->node);
        lt_free(pTimerData);
        ets_timer->priv = NULL;
    }
    return;
}

/****************************************************************************
 * Name: lt_timer_setfn
 *
 * Description:
 *   Set timer callback function and private data
 *
 * Input Parameters:
 *   ptimer    - Timer data pointer
 *   pfunction - Callback function
 *   parg      - Callback function private data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lt_timer_setfn(void *ptimer, void *pfunction, void *parg)
{
    struct ets_timer *ets_timer = (struct ets_timer *)ptimer;
    LOG_ENTRY_TIMER(ptimer);
    if (ets_timer->expire != TIMER_INITIALIZED_VAL) {
        ets_timer->priv = NULL;
    }
    timerData_t * pTimerData = (timerData_t *)ets_timer->priv;
    if (ets_timer->priv == NULL) {
        pTimerData = (timerData_t *)lt_malloc(sizeof(timerData_t));
        LTAtomic_Store(&pTimerData->timerState, kTimerStopped);
        LTList_AddTail(&g_timers, &pTimerData->node);
        ets_timer->priv = pTimerData;
        ets_timer->expire = TIMER_INITIALIZED_VAL;
    }
    if(pTimerData) {
        pTimerData->pClientData = parg;
        pTimerData->pTimerProc  = (LTThread_TimerProc *)pfunction;
    }
}

static void lt_timer_arm_user_context(void *data)
{
    timerData_t *pTimerData = (timerData_t *)data;
    s_iThread->SetTimer(g_hThread_wifi_timers, LTTime_Microseconds(pTimerData->interval_us), DispatchAndKillTimer, NULL, pTimerData);
}

static void lt_timer_arm_us(void *ptimer, u32 us, bool repeat) LT_ISR_SAFE
{
    LOG_ENTRY_TIMER_ARM(ptimer, us, repeat);
    struct ets_timer *ets_timer = (struct ets_timer *)ptimer;
    timerData_t * pTimerData = (timerData_t *)ets_timer->priv;
    if (ets_timer->expire == TIMER_INITIALIZED_VAL) {
        pTimerData->reload      = repeat;
        pTimerData->interval_us = us;
        LTAtomic_Store(&pTimerData->timerState, kTimerRunning);

        if (!s_core->InsideInterruptContext()) {
            s_iThread->SetTimer(g_hThread_wifi_timers, LTTime_Microseconds(us), DispatchAndKillTimer, NULL, pTimerData);
        } else {
            s_iThread->QueueTaskProc(g_hThread_wifi_timers, lt_timer_arm_user_context, NULL, pTimerData);
        }
    }
}

/****************************************************************************
 * Name: lt_timer_get_time
 *
 * Description:
 *   Get system time of type int64_t
 *
 * Input Parameters:
 *   periph - No mean
 *
 * Returned Value:
 *   System time
 *
 ****************************************************************************/

static int64_t lt_timer_get_time(void)
{
    LOG_ENTRY();
    return (int64_t)LTTime_GetMicroseconds(s_core->GetKernelTime());
}

