rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
static void DispatchAndKillTimer(void * pClientData)
{
    timerData_t *pTimerData = (timerData_t *)pClientData;
    LOG_ENTRY();
    if (!pTimerData) return;
    u32 state = LTAtomic_Load(&pTimerData->timerState);
    if (state != kTimerRunning) return;
    if (!pTimerData->reload) {
        if (LTAtomic_CompareAndExchange(&pTimerData->timerState, kTimerRunning, kTimerStopped)) {
            s_iThread->KillTimer(g_hThread_wifi_timers, DispatchAndKillTimer, pClientData);
        }
    }
    /* call the timer callback */
    pTimerData->pTimerProc(pTimerData->pClientData);
}

int wifi_bt_coexist_init(void)
{
    coex_dbg_set_log_level(ESP_BT_COEX_LOG_LEVEL_INFO);
    esp_coex_adapter_register(&g_coex_adapter_funcs);
    coex_pre_init();
    return 0;
}

/****************************************************************************
 * Name: __assert_func
 *
 * Description:
 *   Delete timer and free resource
 *
 * Input Parameters:
 *   file  - assert file
 *   line  - assert line
 *   func  - assert function
 *   expr  - assert condition
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void __assert_func(const char *file, int line,
                   const char *func, const char *expr)
{
    LTLOG_REDALERT("assert","failed in %s, %s:%d (%s)", func, file, line, expr);
    LT_ASSERT(0);
    while(1);
}

int __wrap_sprintf(char* str, const char* fmt, ...)
{
    int ret;
    lt_va_list args;
    lt_va_start(args, fmt);
    /* FIXME: insecure - 1024?  */
    ret = lt_vsnprintf(str, 1024, fmt, args);
    lt_va_end(args);
    return ret;
}
int __wrap_puts(const char* str)
{
    s_core->ConsoleStomp("%s", str);
    return 0;
}

int __wrap_gettimeofday(struct timeval *restrict tv,
                        void* tz)
{
    LT_UNUSED(tz);
    LTTime currTime = s_core->GetKernelTime();
    LTTime secTime = LTTime_Seconds(LTTime_GetSeconds(currTime));
    tv->tv_sec  = (time_t)LTTime_GetSeconds(currTime);
    tv->tv_usec = (long)LTTime_GetMicroseconds(LTTime_Subtract(currTime, secTime));
    return 0;
}

int coexist_printf(const char *format, ...)
{
#ifdef LT_DEBUG_WIRELESS_INFO
    lt_va_list args;
    lt_va_start(args, format);
    LTLOGV("coexist", format, args);
    lt_va_end(args);
#else
    LT_UNUSED(format);
#endif
    return 0;
}

/****************************************************************************
 * Functions needed by libphy.a
 ****************************************************************************/
/****************************************************************************
 * Name: esp_dport_access_reg_read
 *
 * Description:
 *   Read regitser value safely in SMP
 *
 * Input Parameters:
 *   reg - Register address
 *
 * Returned Value:
 *   Register value
 *
 ****************************************************************************/

u32 IRAM_ATTR esp_dport_access_reg_read(u32 reg)
{
    return (*(volatile u32 *)(reg));
}
/****************************************************************************
 * Name: phy_enter_critical
 *
 * Description:
 *   Enter critical state
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   CPU PS value
 *
 ****************************************************************************/

u32 IRAM_ATTR phy_enter_critical(void)
{
    return (u32)s_core->Disable();
}

/****************************************************************************
 * Name: phy_exit_critical
 *
 * Description:
 *   Exit from critical state
 *
 * Input Parameters:
 *   level - CPU PS value
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void IRAM_ATTR phy_exit_critical(u32 level)
{
    s_core->Enable(level);
}

/****************************************************************************
 * Name: phy_printf
 *
 * Description:
 *   Output format string and its arguments
 *
 * Input Parameters:
 *   format - format string
 *
 * Returned Value:
 *   0
 *
 ****************************************************************************/

int phy_printf(const char *format, ...)
{

#ifdef LT_DEBUG_WIRELESS_INFO
    lt_va_list args;
    lt_va_start(args, format);
    LTLOGV("phy", format, args);
    lt_va_end(args);
#else
    LT_UNUSED(format);
#endif
    return 0;
}

/****************************************************************************
 * Name: esp32_clk_val_is_valid
 *
 * Description:
 *   Values of RTC_XTAL_FREQ_REG and RTC_APB_FREQ_REG are
 *   stored as two copies in lower and upper 16-bit halves.
 *   These are the routines to work with such a representation.
 *
 * Input Parameters:
 *   val   - register value
 *
 * Returned Value:
 *   true:  Valid register value.
 *   false: Invalid register value.
 *
 ****************************************************************************/

static inline bool esp32_clk_val_is_valid(u32 val)
{
    return (val & 0xffff) == ((val >> 16) & 0xffff)
           && val != 0 && val != UINT32_MAX;
}

/****************************************************************************
 * Name: esp32_rtc_clk_xtal_freq_get
 *
 * Description:
 *   Get main XTAL frequency
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   XTAL frequency (one of enum esp32_rtc_xtal_freq_e values)
 *
 ****************************************************************************/

enum esp32_rtc_xtal_freq_e IRAM_ATTR esp32_rtc_clk_xtal_freq_get(void)
{
    /* We may have already written XTAL value into RTC_XTAL_FREQ_REG */

#if CONFIG_IDF_TARGET_ESP32
    u32 xtal_freq_reg = ESP32_REG(RTC_CNTL_XTAL_FREQ);
#else
    u32 xtal_freq_reg = Esp32s3_XtalFreqRegRead();
#endif

    if (!esp32_clk_val_is_valid(xtal_freq_reg)) {
        return RTC_XTAL_FREQ_AUTO;
    }

    return (xtal_freq_reg & ~RTC_DISABLE_ROM_LOG) & UINT16_MAX;
}

/****************************************************************************
 * Name: lt_map_external_irq
 *
 * Description:
 *   Point a peripheral interrupt source at a CPU interrupt line.  The esp32s3
 *   moved the mux out of DPORT into INTERRUPT_CORE0/1, and its register header
 *   cannot be included here, so that part goes through Esp32s3_LTOSAdapter.c -
 *   which also rejects a line the level 1 dispatcher could not reach.
 *
 * Returned Value:
 *   true if the source was routed, false if nothing was written
 *
 ****************************************************************************/

