rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
static bool lt_map_external_irq(s32 cpu_no, u32 intr_source, u32 intr_num)
{
#if CONFIG_IDF_TARGET_ESP32
    if (cpu_no != 0) {
        return false;
    }
    Esp32MapExternalToCPUIrq(0, (Esp32_ExternalIrq)intr_source, (Esp32_IrqNumber)intr_num);
    return true;
#else
    return Esp32s3_MapRadioIrq(cpu_no, intr_source, intr_num);
#endif
}

/****************************************************************************
 * Name: esp_set_isr
 *
 * Description:
 *   Register interrupt function
 *
 * Input Parameters:
 *   n   - Interrupt ID
 *   f   - Interrupt function
 *   arg - Function private data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
static void esp_set_isr(int32_t n, void *f, void *arg)
{
    LTLOG_DEBUG("set.isr", "n=%d f=%p arg=%p irq=%d\n", (int)n, f, arg, (int)n);
    LT_ASSERT(n == kEsp32_IrqNumber_WiFiMAC);
    for (int i=0; i<g_num_irq; i++) {
        if(g_irq_info[i].n == -1 || g_irq_info[i].n == n) {
            g_irq_info[i].f_user = f;
            g_irq_info[i].arg = arg;
            g_irq_info[i].n = n;
            s_core->SetInterruptVector(kEsp32_IrqNumber_WiFiMAC,(LTCore_InterruptHandler *)g_irq_info[i].stub, kEsp32_IrqPriority_WiFiMAC);
            return;
        }
    }
}

/****************************************************************************
 * Name: esp_ble_set_isr
 *
 * Description:
 *   Register interrupt function
 *
 * Input Parameters:
 *   n   - Interrupt ID
 *   f   - Interrupt function
 *   arg - Function private data
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#if CONFIG_IDF_TARGET_ESP32
static xt_handler esp_ble_set_isr(s32 n, xt_handler f, void *arg)
{

    LTLOG_DEBUG("set.isr", "n=%d f=%p arg=%p irq=%d\n", (int)n, f, arg, (int)n);
    LT_ASSERT(n == kEsp32_IrqNumber_BT_BB_NMI ||
              n == kEsp32_IrqNumber_RWBLE_IRQ ||
              n == kEsp32_IrqNumber_RWBT_NMI);

    for (s32 i = 0; i < g_num_irq; i++) {
        if(g_irq_info[i].n == -1 || g_irq_info[i].n == n) {
            g_irq_info[i].f_user = f;
            g_irq_info[i].arg    = arg;
            g_irq_info[i].n      = n;
            LTLOG_DEBUG("set.isr", "i=%d n=%d\n", (int)i, (int)n);
            s_core->SetInterruptVector(n, (LTCore_InterruptHandler *)g_irq_info[i].stub, kEsp32_IrqPriority_BLE);
            return NULL;
        }
    }
    return NULL;
}
#endif  /* CONFIG_IDF_TARGET_ESP32 */

/****************************************************************************
 * Name: interrupt_disable
 *
 * Description:
 *   Enter critical section by disabling interrupts and taking the spin lock
 *   if in SMP mode.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void IRAM_ATTR interrupt_disable(void)
{
    LT_SIZE nMask = s_core->Disable();
    if (disableCount++ == 0) {
        disableMask = nMask;
    } else {
        s_core->Enable(nMask);
    }
}

/****************************************************************************
 * Name: interrupt_restore
 *
 * Description:
 *   Exit from critical section by enabling interrupts and releasing the spin
 *   lock if in SMP mode.
 *
 * Input Parameters:
 *  None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR interrupt_restore(void)
{
    LT_ASSERT(s_core->InterruptsAreDisabled());
    LT_ASSERT(disableCount >= 1);
    if (--disableCount == 0) {
        s_core->Enable(disableMask);
    }
}

static void IRAM_ATTR lt_task_yield(void)
{
    s_iThread->Yield();
}

static void IRAM_ATTR lt_task_yield_from_isr(void)
{
    return;
}

static void *lt_mutex_create(void)
{
    LTMutex *mutex = lt_createobject(LTMutex); LOG_ENTRY_MUTEX(mutex);
    if (!mutex) return NULL;
    return mutex;
}

static void lt_mutex_delete(void *pMtx)
{
    LTMutex *mutex = pMtx; LOG_ENTRY_MUTEX(mutex);
    lt_destroyobject(mutex);
}

static s32 lt_mutex_lock(void *pMtx)
{
    LTMutex *mutex = pMtx;
    if (mutex) { LOG_ENTRY_MUTEX(mutex);
        mutex->API->Lock(mutex);
        return ESP_OK;
    }
    return ESP_FAIL;
}

static s32 lt_mutex_unlock(void *pMtx)
{
    LTMutex *mutex = pMtx;
    if (mutex) { LOG_ENTRY_MUTEX(mutex);
        mutex->API->Unlock(mutex);
        return ESP_OK;
    }
    return ESP_FAIL;
}

static void * lt_queue_create(u32 queue_len, u32 item_size)
{
    LOG_ENTRY();

    LT_SIZE rawNodeSize = sizeof(LTList_Node) + ((item_size + 0x7) & ~0x7);
    LT_SIZE nBytes = sizeof(ESP32AdapterQueue) + queue_len * rawNodeSize;
    ESP32AdapterQueue * queue = (ESP32AdapterQueue *)lt_malloc(nBytes);
    if (! queue) return NULL;
    lt_memset(queue, 0, nBytes);
    LTList_Init(&queue->queuedNodes);
    LTList_Init(&queue->freeNodes);
    queue->queueLen = queue_len;
    queue->itemSize = item_size;
    LTList_Node *node = (LTList_Node *)(((u8 *)queue) + sizeof(ESP32AdapterQueue));
    while (queue_len--) {
        node->pPrev = node->pNext = node;
        LTList_AddTail(&queue->freeNodes, node);
        node = (LTList_Node *)((u8 *)node + rawNodeSize);
    }
    return (void *)queue;
}

static void lt_queue_delete(void * pQueue)
{
    LOG_ENTRY();
    //NOTE: we should probably empty the queue first (dependso on the OS implementation)
    lt_free(pQueue);
}

/****************************************************************************
 * Name: lt_queue_send
 *
 * Description:
 *   Send message of low priority to queue within a certain period of time
 *
 * Input Parameters:
 *   pQueue - Message queue data pointer
 *   item   - Message data pointer
 *   ticks  - Wait ticks
 *
 * Returned Value:
 *   True if success or false if fail
 *
 ****************************************************************************/

static s32 lt_queue_send(void * pQueue, void *item, u32 ticks)
{
    LT_SIZE mask;
    LTList_Node *node;
    LTTime expiration = TicksToAbsTime(ticks);
    ESP32AdapterQueue *queue = (ESP32AdapterQueue *)pQueue;
    do {
        mask = s_core->Disable();
        node = queue->freeNodes.pNext;
        if (node != &queue->freeNodes) {
            LTList_Remove(node);
            lt_memcpy((u8 *)node + sizeof(*node), item, queue->itemSize);
            LTList_AddTail(&queue->queuedNodes, node);
            s_core->Enable(mask);
            LOG_MSG_SUCCESS(item, queue->itemSize);
            return true;
        }
        s_core->Enable(mask);
        s_iThread->Sleep(QUEUE_IS_FULL_SLEEP_TIME);
    }
    while (LTTime_IsLessThan(s_core->GetKernelTime(), expiration));
    LOG_MSG_FAIL();
    return false;
}

/****************************************************************************
 * Name: lt_queue_send_from_isr
 *
 * Description:
 *   Send message of low priority to queue in ISR within
 *   a certain period of time
 *
 * Input Parameters:
 *   pQueue- Message queue data pointer
 *   item  - Message data pointer
 *   hptw  - No mean
 *
 * Returned Value:
 *   True if success or false if fail
 *
 ****************************************************************************/

static s32 lt_queue_send_from_isr(void * pQueue, void *item, void *hptw)
{
    LOG_ENTRY_ISR2();
    ESP32AdapterQueue *queue = (ESP32AdapterQueue *)pQueue;

    *((int *)hptw) = false;

    LT_SIZE mask = s_core->Disable();
    LTList_Node *node = queue->freeNodes.pNext;
    if (node == &queue->freeNodes) { s_core->Enable(mask); return false; }
    LTList_Remove(node);
    lt_memcpy((u8 *)node + sizeof(*node), item, queue->itemSize);
    LTList_AddTail(&queue->queuedNodes, node);
    s_core->Enable(mask);
    return true;
}

/****************************************************************************
 * Name: lt_queue_send_to_front
 *
 * Description:
 *   Send message of high priority to queue within a certain period of time
 *
 * Input Parameters:
 *   pQueue- Message queue data pointer
 *   item  - Message data pointer
 *   ticks - Wait ticks
 *
 * Returned Value:
 *   True if success or false if fail
 *
 ****************************************************************************/

static s32 lt_queue_send_to_front(void * pQueue, void *item,
                                      u32 ticks)
{
    LT_SIZE mask;
    LTList_Node *node;
    ESP32AdapterQueue *queue = (ESP32AdapterQueue *)pQueue;
    LTTime expiration = TicksToAbsTime(ticks);
    do {
        mask = s_core->Disable();
        node = queue->freeNodes.pNext;
        if (node != &queue->freeNodes) {
            LTList_Remove(node);
            lt_memcpy((u8 *)node + sizeof(*node), item, queue->itemSize);
            LTList_InsertHead(&queue->queuedNodes, node);
            s_core->Enable(mask);
            LOG_MSG_SUCCESS(item, queue->itemSize);
            return true;
        }
        s_core->Enable(mask);
        s_iThread->Sleep(QUEUE_IS_FULL_SLEEP_TIME);
    }
    while (LTTime_IsLessThan(s_core->GetKernelTime(), expiration));
    LOG_MSG_FAIL();
    return false;
}


/****************************************************************************
 * Name: lt_queue_recv
 *
 * Description:
 *   Receive message from queue within a certain period of time
 *
 * Input Parameters:
 *   pQueue- Message queue data pointer
 *   item  - Message data pointer
 *   ticks - Wait ticks
 *
 * Returned Value:
 *   True if success or false if fail
 *
 ****************************************************************************/

static s32 lt_queue_recv(void * pQueue, void *item, u32 ticks)
{
    LT_SIZE mask;
    LTList_Node *node;
    ESP32AdapterQueue *queue = (ESP32AdapterQueue *)pQueue;
    LTTime expiration = TicksToAbsTime(ticks);
    do {
        mask = s_core->Disable();
        node = queue->queuedNodes.pNext;
        if (node != &queue->queuedNodes) {
            LTList_Remove(node);
            lt_memcpy(item, (u8 *)node + sizeof(*node), queue->itemSize);
            LTList_AddTail(&queue->freeNodes, node);
            s_core->Enable(mask);
            LOG_MSG_SUCCESS(item, queue->itemSize);
            return true;
        }
        s_core->Enable(mask);
        s_iThread->Sleep(QUEUE_IS_FULL_SLEEP_TIME);
    }
    while (LTTime_IsLessThan(s_core->GetKernelTime(), expiration));
    LOG_MSG_FAIL();
    return false;
}

/****************************************************************************
 * Name: queue_recv_from_isr_wrapper
 *
 * Description:
 *   Receive message from queue within a certain period of time
 *
 * Input Parameters:
 *   pQueue - Message queue data pointer
 *   pItem  - Message data pointer
 *   pHptw - Unused
 *
 * Returned Value:
 *   True if success or false if fail
 *
 ****************************************************************************/

