rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
static s32 IRAM_ATTR queue_recv_from_isr_wrapper(void * pQueue,
                                                 void * pItem,
                                                 void * pHptw)
{
    LT_UNUSED(pHptw);
    LTLOG("LT.QUEUE.RECV.FROM.ISR.WRAPPER", "queue: 0x%lx, item: 0x%lx", LT_Pu32(pQueue), LT_Pu32(pItem));
    return 0;
}

/****************************************************************************
 * Name: lt_queue_msg_waiting
 *
 * Description:
 *   Get message number in the message queue
 *
 * Input Parameters:
 *   pQueue - Message queue data pointer
 *
 * Returned Value:
 *   Message number
 *
 ****************************************************************************/

static u32 lt_queue_msg_waiting(void * pQueue)
{
    u32 size = 0;
    ESP32AdapterQueue *queue = (ESP32AdapterQueue *)pQueue;

    LT_SIZE flags = s_core->Disable();
    LTList_ForEach(pNode, &queue->queuedNodes) { size++; } LTList_EndForEach;
    s_core->Enable(flags);

    LOG_ENTRY_MSG_WAIT(size);
    return size;
}

/****************************************************************************
 * Name: lt_task_create_pinned_to_core
 *
 * Description:
 *   Create task and bind it to target CPU, the task will run when it
 *   is created - TODO: SMP
 *
 * Input Parameters:
 *   entry       - Task entry
 *   name        - Task name
 *   stack_depth - Task stack size
 *   param       - Task private data
 *   prio        - Task priority
 *   task_handle - Task handle pointer which is used to pause, resume
 *                 and delete the task
 *   coreID     - CPU which the task runs in
 *
 * Returned Value:
 *   True if success or false if fail
 *
 ****************************************************************************/

static s32 lt_task_create_pinned_to_core(void * entry,
                                              const char *name,
                                              u32    stack_depth,
                                              void * param,
                                              u32    prio,
                                              void * task_handle,
                                              u32    coreID)
{
    LTLOG_DEBUG("on.core", "%d", (int)coreID);
    LT_UNUSED(coreID);
    return lt_task_create(entry, name, stack_depth, param, prio, task_handle);
}

/****************************************************************************
 * Name: lt_task_delete
 *
 * Description:
 *   Delete the target task
 *
 * Input Parameters:
 *   task_handle - Task handle pointer which is used to pause, resume
 *                 and delete the task
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lt_task_delete(void *task_handle)
{
    LOG_ENTRY();
    LTThread hThread;
    if (task_handle) {
        hThread = VOIDPTR_TO_LTHANDLE(task_handle);
    } else {
        hThread = s_iThread->GetCurrentThread();
    }
    s_iThread->Terminate(hThread);
}

/****************************************************************************
 * Name: is_in_isr_wrapper
 *
 * Description: Check if in isr - not required at the moment
 *
 * Input Parameters:
 *  None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static bool IRAM_ATTR is_in_isr_wrapper(void) LT_ISR_SAFE
{
    return s_core->InsideInterruptContext();
}

/****************************************************************************
 * Name: cause_sw_intr_to_core_wrapper
 *
 * Description:
 *   Just a wrapper to cause_sw_intr
 *
 * Input Parameters:
 *  coreID - ID of the CPU core, not used.
 *  nIntr - Number of the software interrupt
 *
 * Returned Value:
 *   Always return OK.
 *
 ****************************************************************************/

#if CONFIG_IDF_TARGET_ESP32
static s32 IRAM_ATTR cause_sw_intr_to_core_wrapper(s32 coreID, s32 nIntr)
{
    LT_UNUSED(coreID);
    LT_ESP32_XTHAL_SET_INTSET((1 << nIntr));
    return ESP_OK;
}
#endif  /* CONFIG_IDF_TARGET_ESP32 */

/****************************************************************************
 * Name: convert_mac
 *
 * Description:
 *   Helper function for converting a MAC address to a BT or SOFT-AP address
 *
 * Input Parameters:
 *  mac  - MAC address buffer pointer
 *  type - type of the address left in mac
 *
 * Returned Value:
 *   0 if success or -1 if fail.
 *
 ****************************************************************************/
static s32 convert_mac(u8 mac[6], esp_mac_type_t type) {
    u8 tmp;
    int i;
    if (type == ESP_MAC_WIFI_SOFTAP) {
        tmp = mac[0];
        for (i = 0; i < 64; i++) {
            mac[0] = tmp | 0x02;
            mac[0] ^= i << 2;

            if (mac[0] != tmp) {
                break;
            }
        }

        if (i >= 64) {
            LTLOG_YELLOWALERT("error.softap.mac","Failed to generate SoftAP MAC\n");
            return -1;
        }
    }

    if (type == ESP_MAC_BT) {
        tmp = mac[0];
        for (i = 0; i < 64; i++) {
            mac[0] = tmp | 0x02;
            mac[0] ^= i << 2;

            if (mac[0] != tmp) {
                break;
            }
        }
        mac[5] += 1;
    }
    return 0;
}

/****************************************************************************
 * Name: esp_read_efuse_mac
 *
 * Description:
 *   Read MAC address from efuse
 *
 * Input Parameters:
 *   mac  - MAC address buffer pointer
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static s32 IRAM_ATTR esp_read_efuse_mac(u8 mac[6])
{
#if !CONFIG_IDF_TARGET_ESP32
    /* Different efuse words, and no MAC CRC beside them on the esp32s3. */

    return Esp32s3_ReadEfuseMac(mac);
#else
    uint32_t regval[2];
    uint8_t *data = (uint8_t *)regval;
    uint8_t crc;
    int i;

    regval[0] = ESP32_REG(MAC_ADDR0);
    regval[1] = ESP32_REG(MAC_ADDR1);

    crc = data[6];
    for (i = 0; i < MAC_LEN; i++) {
        mac[i] = data[5 - i];
    }

    if (crc != esp_crc8(mac, MAC_LEN)) {
        LTLOG("read.mac.error.crc","Failed to check MAC address CRC\n");
        return -1;
    }
    return 0;
#endif
}

/****************************************************************************
 * Name: esp_read_mac
 *
 * Description:
 *   Read MAC address supplied at the initialization time
 *
 * Input Parameters:
 *   mac  - MAC address buffer pointer
 *   type - MAC address type
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

esp_err_t esp_read_mac(uint8_t *mac, esp_mac_type_t type)
{
    LOG_ENTRY();
    if (type > ESP_MAC_BT) {
        LTLOG("read.mac.error", "Input type is error=%d\n", type);
        return -1;
    }

    lt_memcpy(mac, wifi_mac_address, 6);
    return convert_mac(mac, type);
}

/****************************************************************************
 * Name: esp_malloc
 *
 * Description:
 *   Allocate a block of memory
 *
 * Input Parameters:
 *   size - memory size
 *
 * Returned Value:
 *   Memory pointer
 *
 ****************************************************************************/

static void * esp_malloc(u32 size)
{
    return lt_malloc(size);
}

/****************************************************************************
 * Name: esp_wifi_malloc
 *
 * Description:
 *   Allocate a block of memory
 *
 * Input Parameters:
 *   size - memory size
 *
 * Returned Value:
 *   Memory pointer
 *
 ****************************************************************************/

static void * esp_wifi_malloc(unsigned int size)
{
    return lt_malloc(size);
}

