rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
static s32 IRAM_ATTR read_mac_wrapper(u8 mac[6])
{
    esp_read_efuse_mac(mac);
    return convert_mac(mac, ESP_MAC_BT);
}

/****************************************************************************
 * Name: srand_wrapper
 *
 * Description:
 *   Seed the random number generator - not required at the moment
 *
 * Input Parameters:
 *  None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void IRAM_ATTR srand_wrapper(u32 seed)
{
    LT_UNUSED(seed);
}

/****************************************************************************
 * Name: lt_rand_stub
 *
 * Description:
 *   Get random data of type int - not required at the moment
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Random data
 *
 ****************************************************************************/

static u32 lt_get_ccount(void) LT_ISR_SAFE
{
    u32 res;
    RSR(CCOUNT, res);
    return res;
}

/* WDEV_RND is at 0x60035144 on the esp32 and 0x6003507c on the esp32s3, so the
 * shared esp32 register header cannot supply it for both. */

#if CONFIG_IDF_TARGET_ESP32
#define LT_ESP32_RANDOM_REG_READ()  ESP32_REG(WDEV_RND)
#else
#define LT_ESP32_RANDOM_REG_READ()  Esp32s3_RandomRegRead()
#endif

/* The CPU clock in MHz, which is also the CPU:APB ratio the sample spacing
 * below is derived from.  The esp32 reads the ROM's g_ticks_per_us_pro; the
 * esp32s3 ROM keeps no such global. */

#if CONFIG_IDF_TARGET_ESP32
#define LT_ESP32_CPU_MHZ()          g_ticks_per_us_pro
#else
#define LT_ESP32_CPU_MHZ()          Esp32s3_CpuClockMHzGet()
#endif

static s32 lt_rand_stub(void) LT_ISR_SAFE
{
    u32 nCpuMHz = LT_ESP32_CPU_MHZ();
    u32 cpuToApbFreqRatio = (nCpuMHz == 0) ? 1 : nCpuMHz / LT_MIN(nCpuMHz, (u32)80);

    u32 ccount = 0;
    s32 res = 0;
    do {
        ccount = lt_get_ccount();
        res ^= LT_ESP32_RANDOM_REG_READ();
    } while ((ccount - g_nLastCycleCount) < (cpuToApbFreqRatio * APB_CYCLE_WAIT_NUM));
    g_nLastCycleCount = ccount;
    return res ^ LT_ESP32_RANDOM_REG_READ();
}

/****************************************************************************
 * Name: btdm_lpcycles_2_us
 *
 * Description:
 *    Converts a number of low power clock cycles into a duration in us
 *
 * Input Parameters:
 *    cycles - number of CPU cycles
 *
 * Returned Value:
 *    us - value equivalent to the CPU cycles
 *
 ****************************************************************************/

#if CONFIG_IDF_TARGET_ESP32
static u32 IRAM_ATTR btdm_lpcycles_2_us(u32 cycles)
{
    u64 us            = (u64)g_btdm_lpcycle_us * cycles;
    us                = (us + (1 << (g_btdm_lpcycle_us_frac - 1))) >> g_btdm_lpcycle_us_frac;
    return (u32)us;
}

/****************************************************************************
 * Name: btdm_us_2_lpcycles
 *
 * Description:
 * Converts a duration in half us into a number of low power clock cycles.
 *
 * Input Parameters:
 *  us
 *
 * Returned Value:
 *   cycles
 *
 ****************************************************************************/

static u32 IRAM_ATTR btdm_us_2_lpcycles(u32 us)
{
    return (u32) ((u64)(us) << g_btdm_lpcycle_us_frac) / g_btdm_lpcycle_us;
}

static bool btdm_sleep_check_duration(u32 * pSlotCnt)
{
    if (*pSlotCnt < LT_ESP32_BTDM_MIN_SLEEP_DURATION) {
        return false;
    }

    *pSlotCnt -= LT_ESP32_BTDM_MODEM_WAKE_UP_DELAY;
    return true;

}

static s32 IRAM_ATTR coex_bt_request_wrapper(u32 event, u32 latency, u32 duration)
{
    return coex_bt_request(event, latency, duration);
}

static s32 coex_bt_release_wrapper(u32 event)
{
    return coex_bt_release(event);
}

static void xt_ints_on_wrapper(u32 mask)
{
     xt_ints_on((unsigned int)mask);
}

static s32  coex_register_bt_cb_wrapper(coex_func_cb_t cb)
{
    return (s32)coex_register_bt_cb(cb);
}

static s32  coex_schm_register_btdm_callback_wrapper(void *callback)
{
    return (s32)coex_schm_register_btdm_callback(callback);
}

static s32  coex_wifi_channel_get_wrapper(u8 *primary, u8 *secondary)
{
    return (s32)coex_wifi_channel_get((uint8_t*)primary, (uint8_t*)secondary);
}

static s32  coex_register_wifi_channel_change_callback_wrapper(void *cb)
{
    return (s32)coex_register_wifi_channel_change_callback(cb);
}
#endif  /* CONFIG_IDF_TARGET_ESP32 */

#if 0
static void wrapThreadFunc(void * pClientData)
{
    taskData_t * pTaskData = (taskData_t *)pClientData;
    pTaskData->pTaskProc(pTaskData->pClientData);
}
#endif

/****************************************************************************
 * Name: lt_task_create
 *
 * Description:
 *   Create task and the task will run when it is created
 *
 * Input Parameters:
 *   entry       - Task entry
 *   name        - Task name
 *   stack_depth - Task stack size
 *   param       - Task private data
 *   prio        - Task priority
 *   task_handle - Task handle pointer which is used to pause, resume
 *                 and delete the task
 *
 * Returned Value:
 *   True if success or false if fail
 *
 ****************************************************************************/

static s32 lt_task_create(void * entry, const char * name,
                               u32 stack_depth, void *param,
                               u32 prio, void * task_handle)
{
    if (entry == NULL || name == NULL || stack_depth == 0) {
        return false;
    }

    prio = (prio > kLTThread_PriorityHighest) ? kLTThread_PriorityHighest : prio;

    g_hThread_wifi_drv = s_core->CreateThread(name);
    if (!g_hThread_wifi_drv) return false;
    if (!AddHandleToList(&g_threads, g_hThread_wifi_drv)) {
        s_core->DestroyHandle(g_hThread_wifi_drv);
        return false;
    }

    if (task_handle) *((LTThread*)task_handle) = g_hThread_wifi_drv;

    s_iThread->SetPriority(g_hThread_wifi_drv, prio);
    s_iThread->SetStackSize(g_hThread_wifi_drv, THREAD_STACK_SIZE_WIFI_DRIVER); // ignore stack_depth arg
    s_iThread->Start(g_hThread_wifi_drv, NULL, NULL);
    s_iThread->QueueTaskProc(g_hThread_wifi_drv, entry, NULL, param);

