rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
    return true;
}

static void esp_ble_helper_handler0(void)
{
    if (g_irq_info[0].f_user) {
        g_irq_info[0].f_user(g_irq_info[0].arg);
    }
}

static void esp_ble_helper_handler1(void)
{
    if (g_irq_info[1].f_user) {
        g_irq_info[1].f_user(g_irq_info[1].arg);
    }
}

static void esp_ble_helper_handler2(void)
{
    if (g_irq_info[2].f_user) {
        g_irq_info[2].f_user(g_irq_info[2].arg);
    }
}

static void esp_ble_helper_handler3(void)
{
    if (g_irq_info[3].f_user) {
        g_irq_info[3].f_user(g_irq_info[3].arg);
    }
}

void lt_ble_drv_init(void)
{
}

/****************************************************************************
 * Name: wifi_env_is_chip
 *
 * Description:
 *   Config chip environment
 *
 * Returned Value:
 *   True if on chip or false if on FPGA.
 *
 ****************************************************************************/

static bool wifi_env_is_chip(void)
{
    LOG_ENTRY();
    return true;
}

/****************************************************************************
 * Name: wifi_set_intr
 *
 * Description:
 *   Route one radio interrupt source at one CPU line.
 *
 * Input Parameters:
 *     cpu_no      - The CPU which the interrupt number belongs.
 *     intr_source - The interrupt hardware source number.
 *     intr_num    - The interrupt number CPU.
 *     intr_prio   - The interrupt priority.
 *
 * Returned Value:
 *     None
 *
 ****************************************************************************/

static void wifi_set_intr(int32_t cpu_no, uint32_t intr_source,
                          uint32_t intr_num, int32_t intr_prio)
{
    LTLOG_DEBUG("set.intr", "cpu_no=%d, intr_source=%d, intr_num=%u, intr_prio=%d\n",
                (int)cpu_no, (int)intr_source, (int)intr_num, (int)intr_prio);
#if CONFIG_IDF_TARGET_ESP32
    /* The esp32 mux is fixed, so anything else means this table and Esp32_Irq.h
     * disagree rather than that the blob made a runtime choice. */

    LT_ASSERT(cpu_no == 0);
    LT_ASSERT(intr_source == kEsp32_ExternalIrq_WIFIMAC);
    LT_ASSERT(intr_num == kEsp32_IrqNumber_WiFiMAC);
    LT_ASSERT(intr_prio == kEsp32_IrqPriority_WiFiMAC);
    if (cpu_no != 0 || intr_source != kEsp32_ExternalIrq_WIFIMAC ||
        intr_num != kEsp32_IrqNumber_WiFiMAC || intr_prio != kEsp32_IrqPriority_WiFiMAC) {
        LTLOG_REDALERT("set.intr.fatal", "Unexpected interrupt configuration");
        return;
    }
#else
    /* The esp32s3 mux is free and the blobs pick their own line numbers, which
     * lt_map_external_irq() checks are reachable.  intr_prio is a property of
     * the Xtensa line rather than of the routing, so there is nothing to set;
     * IDF's set_intr_wrapper() drops it here too. */

    LT_UNUSED(intr_prio);
#endif
    lt_map_external_irq(cpu_no, intr_source, intr_num);
}

static void IRAM_ATTR wifi_clear_intr(uint32_t intr_source,
                                      uint32_t intr_num)
{
    LOG_ENTRY();
    LT_UNUSED(intr_source);
    LT_UNUSED(intr_num);
}

static void ReleaseLTThreadSemaphore(LTThread_ReleaseReason releaseReason, void * pClientData) {
    LT_ASSERT(   (releaseReason == kLTThread_ReleaseReason_ThreadSpecificReset)   // thread specific client data was set to a new value or cleared
              || (releaseReason == kLTThread_ReleaseReason_ThreadSpecificPurge)); // thread is shutting down due to Terminate(); all thread specific data is released
    LT_UNUSED(releaseReason);
    lt_sem_delete(pClientData);
}

/****************************************************************************
 * Name: esp_thread_semphr_get
 *
 * Description:
 *   Get thread self's semaphore
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Semaphore data pointer
 *
 ****************************************************************************/

static void * esp_thread_semphr_get(void)
{
    void       *sem     = NULL;
    LTThread    hThread = s_iThread->GetCurrentThread();

    if (NULL == (sem = s_iThread->GetThreadSpecificClientData(hThread, ESP_THREAD_SPECIFIC_SEM_KEY))) {
        if (NULL != (sem = lt_sem_create(1, 0))) s_iThread->SetThreadSpecificClientData(hThread, ESP_THREAD_SPECIFIC_SEM_KEY, ReleaseLTThreadSemaphore, sem);
        else { LTLOG("get.th.sem.err","Failed to create semaphore\n"); }
    }

    return sem;
}


/****************************************************************************
 * Name: lt_event_group_create
 *
 * Description:
 *   LT does not support it
 *
 ****************************************************************************/

static void *lt_event_group_create(void)
{
    LT_ASSERT(0);
    return NULL;
}

/****************************************************************************
 * Name: esp_event_group_delete
 *
 * Description:
 *   LT does not support it
 *
 ****************************************************************************/

static void lt_event_group_delete(void *event)
{
    LT_UNUSED(event);
    LT_ASSERT(0);
}

/****************************************************************************
 * Name: lt_event_group_set_bits
 *
 * Description:
 *   LT does not support it
 *
 ****************************************************************************/

static uint32_t lt_event_group_set_bits(void *event, uint32_t bits)
{
    LT_UNUSED(event);
    LT_UNUSED(bits);
    LT_ASSERT(0);
    return false;
}

/****************************************************************************
 * Name: lt_event_group_clear_bits
 *
 * Description:
 *   LT does not support it
 *
 ****************************************************************************/

static uint32_t lt_event_group_clear_bits(void *event, uint32_t bits)
{
    LT_UNUSED(event);
    LT_UNUSED(bits);
    LT_ASSERT(0);
    return false;
}

/****************************************************************************
 * Name: lt_event_group_wait_bits
 *
 * Description:
 *   LT does not support it
 *
 ****************************************************************************/

static uint32_t lt_event_group_wait_bits(void *event,
                                         uint32_t bits_to_wait_for,
                                         int clear_on_exit,
                                         int wait_for_all_bits,
                                         uint32_t block_time_tick)
{
    LT_UNUSED(event);
    LT_UNUSED(bits_to_wait_for);
    LT_UNUSED(clear_on_exit);
    LT_UNUSED(wait_for_all_bits);
    LT_UNUSED(block_time_tick);
    LT_ASSERT(0);
    return false;
}

/****************************************************************************
 * Name: lt_task_delay
 *
 * Description:
 *   Current task wait for some ticks
 *
 * Input Parameters:
 *   tick - Waiting ticks
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lt_task_delay(uint32_t tick)
{
    LOG_ENTRY();
    u32 ms = TICK2MSEC(tick);
    s_iThread->Sleep(LTTime_Milliseconds(ms));
}

/****************************************************************************
 * Name: lt_task_ms_to_tick
 *
 * Description:
 *   Transform from millim seconds to system ticks
 *
 * Input Parameters:
 *   ms - Millim seconds
 *
 * Returned Value:
 *   System ticks
 *
 ****************************************************************************/

static int32_t lt_task_ms_to_tick(uint32_t ms)
{
    return MSEC2TICK(ms);
}

/****************************************************************************
 * Name: lt_task_get_current_task
 *
 *
 ****************************************************************************/

static void * lt_task_get_current_task(void)
{
    LOG_ENTRY_GET_CURR_TASK();
    return (void*) s_iThread->GetCurrentThread();
}

/****************************************************************************
 * Name: lt_task_get_max_priority
 *
 * Description:
 *   Get OS task maximum priority
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Task maximum priority
 *
 ****************************************************************************/

