rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
static int32_t lt_task_get_max_priority(void)
{
    return kLTThread_PriorityHighest;
}

/****************************************************************************
 * Name: lt_event_post
 *
 * Description:
 *   Active work queue and let the work to process the cached event
 *
 * Input Parameters:
 *   event_base      - Event set name
 *   event_id        - Event ID
 *   event_data      - Event private data
 *   event_data_size - Event data size
 *   ticks           - Waiting system ticks
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int32_t lt_event_post(esp_event_base_t event_base,
                             int32_t event_id,
                             void *event_data,
                             size_t event_data_size,
                             uint32_t ticks)
{
    size_t size;
    int32_t id;
    struct evt_adpt *pevt_adpt;
    LT_UNUSED(event_base);
    LT_UNUSED(ticks); // TODO: should it be checked somewhere in event processing thread?
    LTLOG_DEBUG("evt.post", "Event: base=%s id=%d data=%p data_size=%d ticks=%lu\n", event_base,
                (int)event_id, event_data, (int)event_data_size, LT_Pu32(ticks));

    id = esp_event_id_map(event_id);

    if (id < 0) {
        LTLOG("evt.post.err1", "No process event %d\n", (int)event_id);
        return -1;
    }

    size = event_data_size + sizeof(struct evt_adpt);
    pevt_adpt = lt_malloc(size);
    if (!pevt_adpt) {
        LTLOG("evt.post.err2", "Failed to alloc %d memory\n", size);
        return -1;
    }

    pevt_adpt->id = id;
    lt_memcpy(pevt_adpt->buf, event_data, event_data_size);

    s_iThread->QueueTaskProc(g_hThread_wifi_wrk, esp_evt_work_cb, esp_evt_work_complete_cb, pevt_adpt);

    return 0;
}

/****************************************************************************
 * Name: lt_get_free_heap_size
 *
 * Description:
 *   Get free heap size by byte
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Free heap size
 *
 ****************************************************************************/

static uint32_t lt_get_free_heap_size(void)
{
    LOG_ENTRY();
    return s_core->GetAvailableSystemRAM();
}

static void esp_dport_access_stall_other_cpu_start(void)
{
#ifdef LT_HAS_SMP
    LT_ASSERT(0);
#endif
}

void esp_dport_access_stall_other_cpu_end(void)
{
#ifdef LT_HAS_SMP
    LT_ASSERT(0);
#endif
}

/****************************************************************************
 * Name: wifi_apb80m_request
 *
 * Description:
 *   Take Wi-Fi lock in auto-sleep
 *
 ****************************************************************************/

static void wifi_apb80m_request(void)
{

}

/****************************************************************************
 * Name: wifi_apb80m_release
 *
 * Description:
 *   Release Wi-Fi lock in auto-sleep
 *
 ****************************************************************************/

static void wifi_apb80m_release(void)
{
}

/* TODO: Revise that for SMP, these should be a interrupt disabling spinlocks */
/****************************************************************************
 * Name: esp32_phy_enable_clock
 *
 * Description:
 *   Enable PHY hardware clock
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32_phy_enable_clock(void)
{
    LOG_ENTRY_ISR();
    LT_SIZE flags = s_core->Disable();
    if (g_phy_clk_en_cnt == 0) {
        Esp32_ClockEnableRadioCommonClock();
    }
    g_phy_clk_en_cnt++;
    s_core->Enable(flags);
}

/****************************************************************************
 * Name: esp32_phy_disable_clock
 *
 * Description:
 *   Disable PHY hardware clock
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void esp32_phy_disable_clock(void)
{
    LOG_ENTRY_ISR();
    LT_SIZE flags = s_core->Disable();
    if (g_phy_clk_en_cnt > 0) {
        g_phy_clk_en_cnt--;
        if (g_phy_clk_en_cnt == 0) {
            Esp32_ClockDisableRadioCommonClock();
        }
    }
    s_core->Enable(flags);
}
/****************************************************************************
 * Name: esp32_phy_disable
 *
 * Description:
 *   Deinitialize PHY hardware
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32_phy_disable(void)
{
    LOG_ENTRY();
    s_mutex_Phy->API->Lock(s_mutex_Phy);

    g_phy_access_ref--;

    if (g_phy_access_ref == 0) {
        /* Snapshot the digital registers while the RF is still up. */

        phy_digital_regs_store();

        /* Disable PHY and RF. */

        phy_close_rf();
#if !CONFIG_IDF_TARGET_ESP32
        /* Power the PHY temperature sensor down; the esp32 has none. */

        phy_xpd_tsens();
#endif

        /* Disable Wi-Fi/BT common peripheral clock.
         * Do not disable clock for hardware RNG.
         */

        esp32_phy_disable_clock();
    }
    s_mutex_Phy->API->Unlock(s_mutex_Phy);
}

/****************************************************************************
 * Name: esp32_phy_enable
 *
 * Description:
 *   Initialize PHY hardware
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void esp32_phy_enable(void)
{
    esp_phy_calibration_data_t *cal_data = NULL;
    LOG_ENTRY();
#ifdef LT_DEBUG_WIRELESS_INFO
    char *phy_version = get_phy_version_str();
    LTLOG_DEBUG("phy.enable", "phy_version %s\n", phy_version);
#endif
    if (g_phy_access_ref == 0 && g_is_phy_calibrated == false) {
        cal_data = lt_malloc(sizeof(esp_phy_calibration_data_t));
        if (!cal_data) {
            LTLOG("phy.enable.error", "ERROR: Failed to allocate PHY calibration data buffer.");
            return;
        }
        lt_memset(cal_data, 0, sizeof(esp_phy_calibration_data_t));
    }

    /* One time internal RAM buffer for the PHY digital register snapshot.  IDF
     * asks for MALLOC_CAP_DMA and MALLOC_CAP_INTERNAL here.  It lives for as
     * long as the radio does and is never freed.
     */

