rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
    if (g_phy_digital_regs_mem == NULL) {
        g_phy_digital_regs_mem = lt_malloc_internal(ESP32_PHY_DIG_REGS_MEM_SIZE);
        if (g_phy_digital_regs_mem == NULL) {
            LTLOG("phy.enable.error", "ERROR: Failed to allocate PHY digital register buffer.");
        }
    }

    /* A mutex, not an interrupt lock: a full RF calibration runs below and can
     * take tens of milliseconds.  IDF guards this with _lock_acquire() too.
     */

    s_mutex_Phy->API->Lock(s_mutex_Phy);

    if (g_phy_access_ref == 0) {
        esp32_phy_enable_clock();
        if (g_is_phy_calibrated == false && cal_data) {
#if !CONFIG_IDF_TARGET_ESP32
            /* Radio PHY init powers the USB PHY down unless asked not to, and
             * on the esp32s3 the console is behind USB Serial/JTAG. */

            phy_bbpll_en_usb(true);
#endif
            register_chipv7_phy(&phy_init_data, cal_data, PHY_RF_CAL_FULL);
            g_is_phy_calibrated = true;
        } else {
            phy_wakeup_init();
            phy_digital_regs_load();
        }

#if CONFIG_IDF_TARGET_ESP32
        /* Not in the esp32s3 blobs, and IDF only calls it for the esp32. */
        coex_bt_high_prio();
#endif
    }

    g_phy_access_ref++;
    s_mutex_Phy->API->Unlock(s_mutex_Phy);
    if (cal_data) {
        lt_free(cal_data);
    }
}


static int wifi_phy_update_country_info(const char *country)
{
    LT_UNUSED(country);
    return -1;
}

/****************************************************************************
 * Name: esp_wifi_read_mac
 *
 * Description:
 *   Read MAC address from efuse
 *
 * Input Parameters:
 *   mac  - MAC address buffer pointer
 *   type - MAC address type
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int esp_wifi_read_mac(uint8_t *mac, uint32_t type)
{
    LOG_ENTRY();
    return esp_read_mac(mac, type);
}

/****************************************************************************
 * Name: lt_timer_arm
 *
 * Description:
 *   Set timer timeout period and repeat flag
 *
 * Input Parameters:
 *   ptimer - timer data pointer
 *   ms     - millim seconds
 *   repeat - true: run cycle, false: run once
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lt_timer_arm(void *ptimer, uint32_t ms, bool repeat)
{
    LOG_ENTRY_TIMER(ptimer);
    lt_timer_arm_us(ptimer, ms * 1000, repeat);
}

/****************************************************************************
 * Name: wifi_reset_mac
 *
 * Description:
 *   Reset Wi-Fi hardware MAC
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void wifi_reset_mac(void)
{
    LOG_ENTRY();
#if CONFIG_IDF_TARGET_ESP32
    LT_SIZE flags = s_core->Disable();
    u32 nValue = ESP32_REG(DPORT_WIFI_RST_EN);
    nValue |= ESP32_REG_MASK(DPORT_WIFI_RST_EN, MAC_RST_EN);
    ESP32_REG(DPORT_WIFI_RST_EN) = nValue;
    s_core->Enable(flags);
    /* No wait here ??? */
    flags = s_core->Disable();
    nValue = ESP32_REG(DPORT_WIFI_RST_EN);
    nValue &= ~ESP32_REG_MASK(DPORT_WIFI_RST_EN, MAC_RST_EN);
    ESP32_REG(DPORT_WIFI_RST_EN) = nValue;
    s_core->Enable(flags);
#else
    Esp32s3_WiFiResetMac();
#endif
}

/****************************************************************************
 * Name: wifi_clock_enable
 *
 * Description:
 *   Enable Wi-Fi clock.  Nothing to do on the esp32s3: IDF turns the MAC clock
 *   on once in esp_perip_clk_init() and never gates it again, which is why
 *   SYSTEM_WIFI_CLK_WIFI_EN is 0x0 there.  Esp32s3_WiFiBtPowerDomainOn() sets
 *   the bit instead, LT having no equivalent boot-time sweep.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void wifi_clock_enable(void)
{
    LOG_ENTRY();
#if CONFIG_IDF_TARGET_ESP32
    LT_SIZE flags = s_core->Disable();
    u32 nValue = ESP32_REG(DPORT_WIFI_CLK_EN);
    nValue |= ESP32_REG_MASK(DPORT_WIFI_CLK_EN, WIFI_EN);
    ESP32_REG(DPORT_WIFI_CLK_EN) = nValue;
    s_core->Enable(flags);
#endif
}

/****************************************************************************
 * Name: wifi_clock_disable
 *
 * Description:
 *   Disable Wi-Fi clock.  Nothing to do on the esp32s3; see wifi_clock_enable.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void wifi_clock_disable(void)
{
    LOG_ENTRY();
#if CONFIG_IDF_TARGET_ESP32
    LT_SIZE flags = s_core->Disable();
    u32 nValue = ESP32_REG(DPORT_WIFI_CLK_EN);
    nValue &= ~ESP32_REG_MASK(DPORT_WIFI_CLK_EN, WIFI_EN);
    ESP32_REG(DPORT_WIFI_CLK_EN) = nValue;
    s_core->Enable(flags);
#endif
}

static void wifi_rtc_enable_iso(void)
{
}

static void wifi_rtc_disable_iso(void)
{
}

/****************************************************************************
 * Name: esp_nvs_set_i8
 *
 * Description:
 *   Save data of type int8_t into file system
 *
 * Input Parameters:
 *   handle - NVS handle
 *   key    - Data index
 *   value  - Stored data
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int esp_nvs_set_i8(uint32_t handle,
                          const char *key,
                          int8_t value)
{
    LT_UNUSED(handle);
    LT_UNUSED(key);
    LT_UNUSED(value);
    LT_ASSERT(0);
    return -1;
}

/****************************************************************************
 * Name: esp_nvs_get_i8
 *
 * Description:
 *   Read data of type int8_t from file system
 *
 * Input Parameters:
 *   handle    - NVS handle
 *   key       - Data index
 *   out_value - Read buffer pointer
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int esp_nvs_get_i8(uint32_t handle,
                          const char *key,
                          int8_t *out_value)
{
    LT_UNUSED(handle);
    LT_UNUSED(key);
    LT_UNUSED(out_value);
    LT_ASSERT(0);
    return -1;
}

/****************************************************************************
 * Name: esp_nvs_set_u8
 *
 * Description:
 *   Save data of type uint8_t into file system
 *
 * Input Parameters:
 *   handle - NVS handle
 *   key    - Data index
 *   value  - Stored data
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int esp_nvs_set_u8(uint32_t handle,
                          const char *key,
                          uint8_t value)
{
    LT_UNUSED(handle);
    LT_UNUSED(key);
    LT_UNUSED(value);
    LT_ASSERT(0);
    return -1;
}

/****************************************************************************
 * Name: esp_nvs_get_u8
 *
 * Description:
 *   Read data of type uint8_t from file system
 *
 * Input Parameters:
 *   handle    - NVS handle
 *   key       - Data index
 *   out_value - Read buffer pointer
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

