rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
static int esp_nvs_get_u8(uint32_t handle,
                          const char *key,
                          uint8_t *out_value)
{
    LT_UNUSED(handle);
    LT_UNUSED(key);
    LT_UNUSED(out_value);
    LT_ASSERT(0);
    return -1;
}

/****************************************************************************
 * Name: esp_nvs_set_u16
 *
 * Description:
 *   Save data of type uint16_t into file system
 *
 * Input Parameters:
 *   handle - NVS handle
 *   key    - Data index
 *   value  - Stored data
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int esp_nvs_set_u16(uint32_t handle,
                           const char *key,
                           uint16_t value)
{
    LT_UNUSED(handle);
    LT_UNUSED(key);
    LT_UNUSED(value);
    LT_ASSERT(0);
    return -1;
}

/****************************************************************************
 * Name: esp_nvs_get_u16
 *
 * Description:
 *   Read data of type uint16_t from file system
 *
 * Input Parameters:
 *   handle    - NVS handle
 *   key       - Data index
 *   out_value - Read buffer pointer
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int esp_nvs_get_u16(uint32_t handle,
                           const char *key,
                           uint16_t *out_value)
{
    LT_UNUSED(handle);
    LT_UNUSED(key);
    LT_UNUSED(out_value);
    LT_ASSERT(0);
    return -1;
}

/****************************************************************************
 * Name: esp_nvs_open
 *
 * Description:
 *   Create a file system storage data object
 *
 * Input Parameters:
 *   name       - Storage index
 *   open_mode  - Storage mode
 *   out_handle - Storage handle
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int esp_nvs_open(const char *name,
                        uint32_t open_mode,
                        uint32_t *out_handle)
{
    LT_UNUSED(name);
    LT_UNUSED(open_mode);
    LT_UNUSED(out_handle);
    LT_ASSERT(0);
    return -1;
}

/****************************************************************************
 * Name: esp_nvs_close
 *
 * Description:
 *   Close storage data object and free resource
 *
 * Input Parameters:
 *   handle - NVS handle
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static void esp_nvs_close(uint32_t handle)
{
    LT_UNUSED(handle);
    LT_ASSERT(0);
}

/****************************************************************************
 * Name: esp_nvs_commit
 *
 * Description:
 *   This function has no practical effect
 *
 ****************************************************************************/

static int esp_nvs_commit(uint32_t handle)
{
    LT_UNUSED(handle);
    return 0;
}

/****************************************************************************
 * Name: esp_nvs_set_blob
 *
 * Description:
 *   Save a block of data into file system
 *
 * Input Parameters:
 *   handle - NVS handle
 *   key    - Data index
 *   value  - Stored buffer pointer
 *   length - Buffer length
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int esp_nvs_set_blob(uint32_t handle,
                            const char *key,
                            const void *value,
                            size_t length)
{
    LT_UNUSED(handle);
    LT_UNUSED(key);
    LT_UNUSED(value);
    LT_UNUSED(length);
    LT_ASSERT(0);
    return -1;
}

/****************************************************************************
 * Name: esp_nvs_get_blob
 *
 * Description:
 *   Read a block of data from file system
 *
 * Input Parameters:
 *   handle    - NVS handle
 *   key       - Data index
 *   out_value - Read buffer pointer
 *   length    - Buffer length
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int esp_nvs_get_blob(uint32_t handle,
                            const char *key,
                            void *out_value,
                            size_t *length)
{
    LT_UNUSED(handle);
    LT_UNUSED(key);
    LT_UNUSED(out_value);
    LT_UNUSED(length);
    LT_ASSERT(0);
    return -1;
}

/****************************************************************************
 * Name: esp_nvs_erase_key
 *
 * Description:
 *   Read a block of data from file system
 *
 * Input Parameters:
 *   handle    - NVS handle
 *   key       - Data index
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int esp_nvs_erase_key(uint32_t handle, const char *key)
{
    LT_UNUSED(handle);
    LT_UNUSED(key);
    LT_ASSERT(0);
    return -1;
}

/****************************************************************************
 * Name: lt_get_random
 *
 * Description:
 *   Fill random data int given buffer of given length
 *
 * Input Parameters:
 *   buf - buffer pointer
 *   len - buffer length
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int lt_get_random(uint8_t *buf, size_t len) LT_ISR_SAFE
{
    LOG_ENTRY();
    if (!buf) {
        return -1;
    }

    while (len > 0) {
        u32 word = lt_rand_stub();
        u32 bytesToCopy = LT_MIN(len, sizeof(word));
        lt_memcpy(buf, &word, bytesToCopy);
        buf += bytesToCopy;
        len -= bytesToCopy;
    }

    return 0;
}

/****************************************************************************
 * Name: lt_get_time
 *
 * Description:
 *   Get std C time
 *
 * Input Parameters:
 *   t - buffer to store time of type timeval
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

static int lt_get_time(void *t)
{
    LOG_ENTRY();
    struct time_adpt * time_adpt = (struct time_adpt *)t;
    LTTime currTime = s_core->GetKernelTime();
    LTTime secTime  = LTTime_Seconds(LTTime_GetSeconds(currTime));
    time_adpt->sec  = (time_t)LTTime_GetSeconds(currTime);
    time_adpt->usec = (suseconds_t)LTTime_GetMicroseconds(LTTime_Subtract(currTime,secTime));
    return 0;
}

/****************************************************************************
 * Name: lt_log_write
 *
 * Description:
 *   Output log with by format string and its arguments
 *
 * Input Parameters:
 *   level  - log level, no mean here
 *   tag    - log TAG, no mean here
 *   format - format string
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lt_log_write(uint32_t level,
                         const char *tag,
                         const char *format, ...)
{
    LT_UNUSED(tag);
    lt_va_list args;
    lt_va_start(args, format);
    switch (level) {
#ifdef LT_DEBUG_WIRELESS_ERROR
    case ESP_LOG_ERROR:
        LTLOGV_REDALERT(tag, format, args);
        break;
#endif
#ifdef LT_DEBUG_WIRELESS_WARN
    case ESP_LOG_WARN:
        LTLOGV_YELLOWALERT(tag, format, args);
        break;
#endif
#ifdef LT_DEBUG_WIRELESS_INFO
    case ESP_LOG_INFO:
        LTLOGV(tag, format, args);
        break;
    default:
        LTLOGV_DEBUG(tag, format, args);
        break;
#endif
    }
    lt_va_end(args);
}

/****************************************************************************
 * Name: lt_log_writev
 *
 * Description:
 *   Output log with by format string and its arguments
 *
 * Input Parameters:
 *   level  - log level, no mean here
 *   tag    - log TAG, no mean here
 *   format - format string
 *   args   - arguments list
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lt_log_writev(uint32_t level, const char *tag,
                          const char *format, lt_va_list args)
{
    switch (level) {
#ifdef LT_DEBUG_WIRELESS_ERROR
    case ESP_LOG_ERROR:
        LTLOGV_REDALERT(tag, format, args);
        break;
#endif
#ifdef LT_DEBUG_WIRELESS_WARN
    case ESP_LOG_WARN:
        LTLOGV_YELLOWALERT(tag, format, args);
        break;
#endif
#ifdef LT_DEBUG_WIRELESS_INFO
    case ESP_LOG_INFO:
        LTLOGV(tag, format, args);
        break;
    default:
        LTLOGV_DEBUG(tag, format, args);
        break;
#else
    default:
        LT_UNUSED(tag);
        LT_UNUSED(format);
        LT_UNUSED(args);
#endif
    }
}

/****************************************************************************
 * Name: lt_realloc_internal
 *
 * Description:
 *   Drivers allocate a block of memory by old memory block
 *
 * Input Parameters:
 *   ptr  - old memory pointer
 *   size - memory size
 *
 * Returned Value:
 *   New memory pointer
 *
 ****************************************************************************/

static void * lt_realloc_internal(void *ptr, size_t size)
{
    LOG_ENTRY();
    LT_ASSERT(!ADDR_IN_POOL(ptr));
    return lt_realloc(ptr, size);
}

/****************************************************************************
 * Name: lt_calloc_internal
 *
 * Description:
 *   Drivers allocate some continuous blocks of memory
 *
 * Input Parameters:
 *   n    - memory block number
 *   size - memory block size
 *
 * Returned Value:
 *   New memory pointer
 *
 ****************************************************************************/

