rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
static void * lt_calloc_internal(size_t n, size_t size)
{
    LOG_ENTRY();
    void * mem = lt_malloc(n*size);
    if (mem) lt_memset(mem, 0, n*size);
    return mem;
}
void * __wrap_calloc(size_t n, size_t size)
{
    return lt_calloc_internal(n,size);
}
/****************************************************************************
 * Name: lt_zalloc_internal
 *
 * Description:
 *   Drivers allocate a block of memory and clear it with 0
 *
 * Input Parameters:
 *   size - memory size
 *
 * Returned Value:
 *   New memory pointer
 *
 ****************************************************************************/

static void * lt_zalloc_internal(size_t size)
{
    LOG_ENTRY();
    void * ptr = lt_malloc(size);
    if (ptr) {
        lt_memset(ptr, 0, size);
    }
    return ptr;
}

/****************************************************************************
 * Name: lt_wifi_malloc
 *
 * Description:
 *   Applications allocate a block of memory
 *
 * Input Parameters:
 *   size - memory size
 *
 * Returned Value:
 *   Memory pointer
 *
 ****************************************************************************/

static void * lt_wifi_malloc(size_t size)
{
    LOG_ENTRY();
    void * ptr = lt_pool_alloc(size);
    return (ptr)?(ptr):(lt_malloc(size));
}

/****************************************************************************
 * Name: lt_wifi_realloc
 *
 * Description:
 *   Applications allocate a block of memory by old memory block
 *
 * Input Parameters:
 *   ptr  - old memory pointer
 *   size - memory size
 *
 * Returned Value:
 *   New memory pointer
 *
 ****************************************************************************/

static void * lt_wifi_realloc(void *ptr, size_t size)
{
    LOG_ENTRY();
    LT_ASSERT(!ADDR_IN_POOL(ptr));
    return lt_realloc(ptr, size);
}

/****************************************************************************
 * Name: lt_wifi_calloc
 *
 * Description:
 *   Applications allocate some continuous blocks of memory
 *
 * Input Parameters:
 *   n    - memory block number
 *   size - memory block size
 *
 * Returned Value:
 *   New memory pointer
 *
 ****************************************************************************/

static void * lt_wifi_calloc(size_t n, size_t size)
{
    LOG_ENTRY();
    void *mem = lt_malloc(n*size);
    if (mem) lt_memset(mem, 0, n*size);
    return mem;
}

/****************************************************************************
 * Name: lt_wifi_zalloc
 *
 * Description:
 *   Applications allocate a block of memory and clear it with 0
 *
 * Input Parameters:
 *   size - memory size
 *
 * Returned Value:
 *   New memory pointer
 *
 ****************************************************************************/

static void * lt_wifi_zalloc(size_t size)
{
    LOG_ENTRY();
    return lt_zalloc_internal(size);
}

/****************************************************************************
 * Name: lt_wifi_create_queue
 *
 * Description:
 *   Create Wi-Fi static message queue
 *
 * Input Parameters:
 *   queue_len - queue message number
 *   item_size - message size
 *
 * Returned Value:
 *   Wi-Fi static message queue data pointer
 *
 ****************************************************************************/

static void * lt_wifi_create_queue(int queue_len, int item_size)
{
    wifi_static_queue_t * wifi_queue;
    LOG_ENTRY();
    wifi_queue = lt_malloc(sizeof(wifi_static_queue_t));
    if (!wifi_queue) {
        LTLOG("wifi.q.create.error","Failed to allocate\n");
        return NULL;
    }

    wifi_queue->handle = lt_queue_create(queue_len, item_size);
    if (!wifi_queue->handle) {
        LTLOG("wifi.q.create.error2","Failed to create queue\n");
        lt_free(wifi_queue);
        return NULL;
    }

    return wifi_queue;
}

/****************************************************************************
 * Name: lt_wifi_delete_queue
 *
 * Description:
 *   Delete Wi-Fi static message queue
 *
 * Input Parameters:
 *   queue - Wi-Fi static message queue data pointer
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void lt_wifi_delete_queue(void * pQueue)
{
    LOG_ENTRY();
    wifi_static_queue_t *wifi_queue = (wifi_static_queue_t *)pQueue;

    lt_queue_delete(wifi_queue->handle);
    lt_free(wifi_queue);
}

static int wifi_coex_init(void)
{
    return coex_init();
}

static void wifi_coex_deinit(void)
{
    coex_deinit();
}

static int wifi_coex_enable(void)
{
    return coex_enable();
}

/****************************************************************************
 * Name: lt_log_timestamp
 *
 * Description:
 *   Get system time by millim second
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   System time
 *
 ****************************************************************************/

static uint32_t lt_log_timestamp(void)
{
    return (uint32_t)(lt_timer_get_time() / 1000);
}

static uint32_t esp_coex_status_get(void)
{
    return coex_status_get();
}

static void esp_coex_condition_set(uint32_t type, bool dissatisfy)
{
    coex_condition_set(type, dissatisfy);
}

static int esp_coex_wifi_request(uint32_t event, uint32_t latency,
                                 uint32_t duration)
{
    return coex_wifi_request(event, latency, duration);
}

static int esp_coex_wifi_release(uint32_t event)
{
    return coex_wifi_release(event);
}

static int wifi_coex_wifi_set_channel(uint8_t primary, uint8_t secondary)
{
    return coex_wifi_channel_set(primary, secondary);
}

static int wifi_coex_get_event_duration(uint32_t event, uint32_t *duration)
{
    return coex_event_duration_get(event, duration);
}

static int wifi_coex_get_pti(uint32_t event, uint8_t *pti)
{
    LT_UNUSED(event);
    LT_UNUSED(pti);
    return 0;
}

static void wifi_coex_clear_schm_status_bit(uint32_t type, uint32_t status)
{
    coex_schm_status_bit_clear(type, status);
}

static void wifi_coex_set_schm_status_bit(uint32_t type, uint32_t status)
{
    coex_schm_status_bit_set(type, status);
}

static int wifi_coex_set_schm_interval(uint32_t interval)
{
    return coex_schm_interval_set(interval);
}

static uint32_t wifi_coex_get_schm_interval(void)
{
    return coex_schm_interval_get();
}

static uint8_t wifi_coex_get_schm_curr_period(void)
{
    return coex_schm_curr_period_get();
}

static void *wifi_coex_get_schm_curr_phase(void)
{
    return coex_schm_curr_phase_get();
}

static int wifi_coex_set_schm_curr_phase_idx(int idx)
{
    return coex_schm_curr_phase_idx_set(idx);
}

static int wifi_coex_get_schm_curr_phase_idx(void)
{
    return coex_schm_curr_phase_idx_get();
}

/****************************************************************************
 * Name: esp_event_id_map
 *
 * Description:
 *   Transform from esp-idf event ID to Wi-Fi adapter event ID
 *
 * Input Parameters:
 *   event_id - esp-idf event ID
 *
 * Returned Value:
 *   Wi-Fi adapter event ID
 *
 ****************************************************************************/

static int esp_event_id_map(int event_id)
{
    int id;
    LOG_ENTRY();
    if (event_id >= WIFI_EVENT_MAX) {
        return -1;
    }
    switch (event_id) {
    case WIFI_EVENT_SCAN_DONE:
        id = WIFI_ADPT_EVT_SCAN_DONE;
        break;
    case WIFI_EVENT_STA_START:
        id = WIFI_ADPT_EVT_STA_START;
        break;

