rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
    case WIFI_EVENT_STA_CONNECTED:
        id = WIFI_ADPT_EVT_STA_CONNECT;
        break;

    case WIFI_EVENT_STA_DISCONNECTED:
        id = WIFI_ADPT_EVT_STA_DISCONNECT;
        break;

    case WIFI_EVENT_STA_AUTHMODE_CHANGE:
        id = WIFI_ADPT_EVT_STA_AUTHMODE_CHANGE;
        break;

    case WIFI_EVENT_STA_STOP:
        id = WIFI_ADPT_EVT_STA_STOP;
        break;
    case WIFI_EVENT_STA_BEACON_TIMEOUT:
        id = WIFI_ADPT_EVT_STA_BEACON_TIMEOUT;
        break;
    default:
        return -1;
    }

    return id;
}

/* Needs to be DeviceWiFi callback */
/****************************************************************************
 * Name: esp_wifi_scan_event_parse
 *
 * Description:
 *   Parse scan information
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *     None
 *
 ****************************************************************************/

void esp_wifi_scan_event_parse(void)
{
    wifi_ap_record_t * ap_list_buffer = NULL;
    uint16_t bss_total = 0;
    esp_wifi_scan_get_ap_num(&bss_total);
    LTLOG_DEBUG("scan.evt.parse", "num %u", bss_total);
    if (bss_total == 0) {
        Esp32_ScanResult_STA_CB(0, NULL);
        return;
    }
    ap_list_buffer = lt_malloc(bss_total * sizeof(wifi_ap_record_t));
    if(!ap_list_buffer) {
        LTLOG_YELLOWALERT("scan.no.memory", "cannot allocate mem");
        return;
    }
    /* NOTE: Driver requires this buffer be zeroed! */
    lt_memset(ap_list_buffer, 0, bss_total * sizeof(wifi_ap_record_t));
    Esp32_ScanResult_STA_CB(bss_total, ap_list_buffer);
    if (ap_list_buffer) {
        lt_free(ap_list_buffer);
    }
}

/****************************************************************************
 * Name: esp_evt_work_cb
 *
 * Description:
 *   Process the cached event
 *
 * Input Parameters:
 *   arg - No mean
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/
static void esp_evt_work_cb(void * data)
{
    struct evt_adpt *pevt_adpt = (struct evt_adpt *)data;
    LOG_WORKER_ENTRY();
    if (!pevt_adpt) {
        return;
    }
    LOCK_WIFIAPI();
    switch (pevt_adpt->id) {
    case WIFI_ADPT_EVT_SCAN_DONE:
        esp_wifi_scan_event_parse();
        break;
    case WIFI_ADPT_EVT_STA_START:
        LTLOG_DEBUG("cb.start","Wi-Fi sta start\n");
        break;

    case WIFI_ADPT_EVT_STA_CONNECT:
        LTLOG_DEBUG("sta.connect", "Wi-Fi sta connect\n");
        Esp32_JoinStatus_STA_CB_Success();
        break;

    case WIFI_ADPT_EVT_STA_DISCONNECT:
        wifi_event_sta_disconnected_t *disconnected =
            (wifi_event_sta_disconnected_t *) pevt_adpt->buf;
        LTLOG_DEBUG("sta.disconnect", "Wi-Fi sta disconnect\n");
        Esp32_JoinStatus_STA_CB_Failed(disconnected->reason);
        break;

    case WIFI_ADPT_EVT_STA_STOP:
        LTLOG_DEBUG("sta.stop","Wi-Fi sta stop\n");
        break;
    case WIFI_ADPT_EVT_STA_BEACON_TIMEOUT:
        LTLOG_DEBUG("sta.beacon","Timeout!\n");
        break;
    default:
        break;
    }
    UNLOCK_WIFIAPI();
    LOG_LEAVE();
}

static void esp_evt_work_complete_cb(LTThread_ReleaseReason reason, void * data)
{
    LOG_ENTRY();
    LT_UNUSED(reason);
    if(data) {
        lt_free(data);
    }
}

/****************************************************************************
 * Name: phy_digital_regs_store
 *
 * Description:
 *   Save the PHY digital registers so that a later enable can restore them
 *   instead of recalibrating.  Must run while the RF is still up.
 *
 ****************************************************************************/

static inline void phy_digital_regs_store(void)
{
    LOG_ENTRY();
    if (g_phy_digital_regs_mem != NULL) {
        phy_dig_reg_backup(true, g_phy_digital_regs_mem);
        g_is_phy_reg_stored = true;
    }
}

/****************************************************************************
 * Name: phy_digital_regs_load
 *
 * Description:
 *   Load  PHY digital registers.
 *
 ****************************************************************************/

static inline void phy_digital_regs_load(void)
{
    LOG_ENTRY();
    if (g_is_phy_reg_stored && g_phy_digital_regs_mem != NULL) {
        phy_dig_reg_backup(false, g_phy_digital_regs_mem);
    }
}



static void wifi_coex_disable(void)
{
    coex_disable();
}

/****************************************************************************
 * Name: wifi_errno_trans
 *
 * Description:
 *   Transform from ESP Wi-Fi error code to NuttX error code
 *
 * Input Parameters:
 *   ret - ESP Wi-Fi error code
 *
 * Returned Value:
 *   OS error code
 *
 ****************************************************************************/

static int32_t wifi_errno_trans(int ret)
{
    int wifierr;
    LOG_ENTRY();
    /* Unmask component error bits */
    wifierr = ret & 0xfff;
    if (wifierr == ESP_OK) {
        return ESP_OK;
    } else if (wifierr == ESP_ERR_NO_MEM) {
        return -1;
    } else if (wifierr == ESP_ERR_INVALID_ARG) {
        return -2;
    } else if (wifierr == ESP_ERR_INVALID_STATE) {
        return -3;
    } else if (wifierr == ESP_ERR_INVALID_SIZE) {
        return -4;
    } else if (wifierr == ESP_ERR_NOT_FOUND) {
        return -5;
    } else if (wifierr == ESP_ERR_NOT_SUPPORTED) {
        return -6;
    } else if (wifierr == ESP_ERR_TIMEOUT) {
        return -7;
    } else if (wifierr == ESP_ERR_INVALID_MAC) {
        return -8;
    } else {
        return ESP_FAIL;
    }
}

/****************************************************************************
 * Name: esp_wifi_tx_done_cb
 *
 * Description:
 *   Wi-Fi TX done callback function.
 *
 ****************************************************************************/

static IRAM_ATTR void esp_wifi_tx_done_cb(uint8_t ifidx, uint8_t * data,
        uint16_t * len, bool txstatus)
{
    LT_UNUSED(ifidx);
    LT_UNUSED(data);
    LT_UNUSED(len);
    LT_UNUSED(txstatus);
    LOG_TXDONE_ENTRY("tx.done.cb", "ifidx=%d data=%p *len=%p txstatus=%d\n",
                     ifidx, data, len, txstatus);
}

/****************************************************************************
 * Name: esp_wifi_deinit
 *
 * Description:
 *   Deinitialize Wi-Fi and free resource
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   0 if success or others if fail
 *
 ****************************************************************************/

esp_err_t esp_wifi_deinit(void)
{
    int ret;
    LOG_ENTRY();
    LOCK_WIFIAPI();
    ret = esp_supplicant_deinit();
    if (ret) {
        UNLOCK_WIFIAPI();
        LTLOG_YELLOWALERT("deinit.supp.error", "Failed to deinitialize supplicant\n");
        return ret;
    }

    ret = esp_wifi_deinit_internal();
    if (ret != 0) {
        UNLOCK_WIFIAPI();
        LTLOG_YELLOWALERT("deinit.wifi.error", "Failed to deinitialize Wi-Fi\n");
        return ret;
    }
#if !CONFIG_IDF_TARGET_ESP32
    Esp32s3_WiFiBtPowerDomainOff();
#endif
    UNLOCK_WIFIAPI();
    if (g_hThread_wifi_wrk) {
        s_iThread->Destroy(g_hThread_wifi_wrk);
        g_hThread_wifi_wrk = 0;
    }
    if (g_hThread_wifi_timers) {
        s_iThread->Destroy(g_hThread_wifi_timers);
        g_hThread_wifi_timers = 0;
    }

    return ret;
}

