rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
int esp_wifi_adapter_init(int *p_wifi_ref_cnt)
{
    int ret;
    wifi_init_config_t wifi_cfg = WIFI_INIT_CONFIG_DEFAULT();
    LOG_ENTRY();
    if (*p_wifi_ref_cnt) {
        LTLOG_DEBUG("init.mult", "Wi-Fi adapter is already initialized\n");
        (*p_wifi_ref_cnt)++;
        return ESP_OK;
    }

    LTDeviceIdentity *pIdentity = lt_openlibrary(LTDeviceIdentity);
    if (pIdentity) {
        pIdentity->GetMac(wifi_mac_address);
        lt_closelibrary(pIdentity);
    }
    else {
        esp_read_efuse_mac(wifi_mac_address);
    }

    wifi_bt_coexist_init();

    wifi_cfg.nvs_enable = 0;

#ifdef LT_ESP32_WIFI_TX_AMPDU
    wifi_cfg.ampdu_tx_enable = 1;
#else
    wifi_cfg.ampdu_tx_enable = 0;
#endif

#ifdef LT_ESP32_WIFI_RX_AMPDU
    wifi_cfg.ampdu_rx_enable = 1;
#else
    wifi_cfg.ampdu_rx_enable = 0;
#endif

#ifdef LT_ESP32_WIFI_STA_DISCONNECT_PM
    wifi_cfg.sta_disconnected_pm = true;
#else
    wifi_cfg.sta_disconnected_pm = false;
#endif

    wifi_cfg.rx_ba_win          = LT_ESP32_WIFI_RXBA_AMPDU_WZ;
    wifi_cfg.static_rx_buf_num  = LT_ESP32_WIFI_STATIC_RXBUF_NUM;
    wifi_cfg.dynamic_rx_buf_num = LT_ESP32_WIFI_DYNAMIC_RXBUF_NUM;
    wifi_cfg.dynamic_tx_buf_num = LT_ESP32_WIFI_DYNAMIC_TXBUF_NUM;
    ret = esp_wifi_init(&wifi_cfg);
    if (ret) {
        LTLOG("init.error", "Failed to initialize Wi-Fi error=%d\n", ret);
        ret = wifi_errno_trans(ret);
        goto errout_init_wifi;
    }

    ret = esp_wifi_set_ps(DEFAULT_PS_MODE);
    if (ret) {
        LTLOG("ps.set","Failed to set PS\n");
    }

    ret = esp_wifi_set_tx_done_cb(esp_wifi_tx_done_cb);
    if (ret) {
        LTLOG("tx.callback.error", "Failed to register TX done callback ret=%d\n", ret);
        ret = wifi_errno_trans(ret);
        goto errout_init_txdone;
    }

    (*p_wifi_ref_cnt)++;
    LTLOG_DEBUG("init.ok", "OK to initialize Wi-Fi adapter\n");

    return ESP_OK;

errout_init_txdone:
    esp_wifi_deinit();
errout_init_wifi:
    return ret;
}

void * __wrap_malloc(uint32_t size)
{
    return esp_malloc(size);
}

void * __wrap_realloc(void * pData, LT_SIZE size)
{
    return lt_realloc(pData, size);
}

void __wrap_free(void * ptr)
{
    esp_free(ptr);
}

/****************************************************************************
 * Name: esp_wifi_init
 *
 * Description:
 *   Initialize Wi-Fi
 *
 * Input Parameters:
 *   config - Initialization config parameters
 *
 * Returned Value:
 *   0 if success or others if fail
 *
 ****************************************************************************/

esp_err_t esp_wifi_init(const wifi_init_config_t * config)
{
    int32_t ret = -1;
    LOG_ENTRY();
    if (!g_hThread_wifi_wrk) {
        g_hThread_wifi_wrk = s_core->CreateThread("EspWifiWorker");
        //s_iThread->SetPriority(g_hThread_wifi_wrk, prio);
        s_iThread->SetStackSize(g_hThread_wifi_wrk, THREAD_STACK_SIZE_WIFI_WORKER);
        s_iThread->Start(g_hThread_wifi_wrk, NULL, NULL);
    }

    if (!g_hThread_wifi_timers) {
        g_hThread_wifi_timers = s_core->CreateThread("EspWifiTimers");
        s_iThread->SetPriority(g_hThread_wifi_timers, kLTThread_PriorityHighest);
        s_iThread->SetStackSize(g_hThread_wifi_timers, THREAD_STACK_SIZE_WIFI_TIMERS);
        s_iThread->Start(g_hThread_wifi_timers, NULL, NULL);
    }
    LOCK_WIFIAPI();
    coex_init();
#if !CONFIG_IDF_TARGET_ESP32
    /* The esp32s3 gates the modem behind a power domain that comes up isolated
     * and in reset.  Without this the PHY never answers and the calibration in
     * esp32_phy_enable() hangs.  The esp32 has no such domain. */

    Esp32s3_WiFiBtPowerDomainOn();
#endif
    ret = esp_wifi_init_internal(config);
    if (ret) {
        UNLOCK_WIFIAPI();
        goto cleanup;
    }

    ret = esp_supplicant_init();
    if (ret) {
        LTLOG("init.supplicant.err", "Failed to initialize WPA supplicant error=%d\n", (int)ret);
        esp_wifi_deinit_internal();
        UNLOCK_WIFIAPI();
        goto cleanup;
    }
    UNLOCK_WIFIAPI();
    return 0;
cleanup:
    if (g_hThread_wifi_wrk) {
        s_iThread->Destroy(g_hThread_wifi_wrk);
        g_hThread_wifi_wrk = 0;
    }
    if (g_hThread_wifi_timers) {
        s_iThread->Destroy(g_hThread_wifi_timers);
        g_hThread_wifi_timers = 0;
    }
    WIFI_DRIVER_FAIL();
    return ret;
}

/****************************************************************************
 * Name: esp_timer_stop
 *
 * Description:
 *   Stop timer
 *
 * Input Parameters:
 *   timer  - Timer handle pointer
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

esp_err_t esp_timer_stop(esp_timer_handle_t timer)
{
    LOG_ENTRY();
    timerData_t *pTimerData = (timerData_t *) timer;
    if (!pTimerData) return ESP_ERR_INVALID_ARG;
    if (LTAtomic_CompareAndExchange(&pTimerData->timerState, kTimerRunning, kTimerStopped)) {
        s_iThread->KillTimer(g_hThread_wifi_timers, DispatchAndKillTimer, (void *)pTimerData);
        return ESP_OK;
    }
    return ESP_ERR_INVALID_STATE;
}

/****************************************************************************
 * Name: esp_timer_get_time
 *
 * Description:
 *   Get system time of type int64_t
 *
 * Input Parameters:
 *   periph - No mean
 *
 * Returned Value:
 *   System time
 *
 ****************************************************************************/

int64_t esp_timer_get_time(void)
{
    LOG_ENTRY();
    return lt_timer_get_time();
}

/****************************************************************************
 * Name: esp_timer_start_once
 *
 * Description:
 *   Start timer with one shot mode
 *
 * Input Parameters:
 *   timer      - Timer handle pointer
 *   timeout_us - Timeout value by micro second
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

esp_err_t esp_timer_start_once(esp_timer_handle_t timer, uint64_t timeout_us)
{
    LOG_ENTRY();
    timerData_t *pTimerData = (timerData_t *) timer;
    if (!pTimerData) return ESP_ERR_INVALID_ARG;
    pTimerData->reload      = false;
    pTimerData->interval_us = timeout_us;
    if (LTAtomic_CompareAndExchange(&pTimerData->timerState, kTimerStopped, kTimerRunning)) {
        s_iThread->SetTimer(g_hThread_wifi_timers, LTTime_Microseconds(timeout_us), DispatchAndKillTimer, NULL, pTimerData);
        return ESP_OK;
    }
    return ESP_ERR_INVALID_STATE;
}

/****************************************************************************
 * Name: esp_timer_delete
 *
 * Description:
 *   Delete timer and free resource
 *
 * Input Parameters:
 *   timer  - Timer handle pointer
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

esp_err_t esp_timer_delete(esp_timer_handle_t timer)
{
    LOG_ENTRY();
    timerData_t * pTimerData = (timerData_t *) timer;
    esp_timer_stop(timer);
    LTList_Remove(&pTimerData->node);
    lt_free(pTimerData);
    return 0;
}

