rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/esp32-lt-os-adapter/Esp32_LTOSAdapter.c
/* libwpa_supplicant.a */
void esp_fill_random(void * buf, size_t len) LT_ISR_SAFE
{
    lt_get_random(buf, len);
}

/* NOTE: Nutt-X used esp32 HW timers here, we try to use software LT timers for this, seems fine */
/****************************************************************************
 * Name: esp_timer_create
 *
 * Description:
 *   Create timer with given arguments
 *
 * Input Parameters:
 *   create_args - Timer arguments data pointer
 *   out_handle  - Timer handle pointer
 *
 * Returned Value:
 *   0 if success or -1 if fail
 *
 ****************************************************************************/

esp_err_t esp_timer_create(const esp_timer_create_args_t *create_args, esp_timer_handle_t *out_handle)
{
    timerData_t * pTimerData = NULL;
    LOG_ENTRY();
    pTimerData = (timerData_t *) lt_malloc(sizeof(timerData_t));
    LTAtomic_Store(&pTimerData->timerState, kTimerStopped);
    pTimerData->pClientData = create_args->arg;
    pTimerData->pTimerProc  = (LTThread_TimerProc *) create_args->callback;
    LTList_AddTail(&g_timers, &pTimerData->node);
    *out_handle = (esp_timer_handle_t) pTimerData;
    return ESP_OK;
}

/****************************************************************************
 * Name: net80211_printf
 *
 * Description:
 *   Output format string and its arguments
 *
 * Input Parameters:
 *   format - format string
 *
 * Returned Value:
 *   0
 *
 ****************************************************************************/

int net80211_printf(const char *format, ...)
{
#ifdef LT_DEBUG_WIRELESS_INFO
    lt_va_list args;
    lt_va_start(args, format);
    LTLOGV("net80211", format, args);
    lt_va_end(args);
#else
    LT_UNUSED(format);
#endif
    return 0;
}

/****************************************************************************
 * Name: pp_printf
 *
 * Description:
 *   Output format string and its arguments
 *
 * Input Parameters:
 *   format - format string
 *
 * Returned Value:
 *   0
 *
 ****************************************************************************/

int pp_printf(const char *format, ...)
{
#ifdef LT_DEBUG_WIRELESS_INFO
    lt_va_list args;
    lt_va_start(args, format);
    LTLOGV("pp", format, args);
    lt_va_end(args);
#else
    LT_UNUSED(format);
#endif
    return 0;
}

/****************************************************************************
 * Name: esp_event_send_internal
 *
 * Description:
 *   Post event message to queue
 *
 * Input Parameters:
 *   event_base      - Event set name
 *   event_id        - Event ID
 *   event_data      - Event private data
 *   event_data_size - Event data size
 *   ticks_to_wait   - Waiting system ticks
 *
 * Returned Value:
 *   Task maximum priority
 *
 ****************************************************************************/

esp_err_t esp_event_send_internal(esp_event_base_t event_base,
                                  int32_t event_id,
                                  void * event_data,
                                  size_t event_data_size,
                                  uint32_t ticks_to_wait)
{
    int32_t ret;
    LOG_ENTRY();
    ret = lt_event_post(event_base, event_id, event_data,
                        event_data_size, ticks_to_wait);

    return ret;
}

/****************************************************************************
 * Name: __wrap_intr_matrix_set
 *
 * Description:
 *   Map external Irq to CPU Irq
 *
 * Input Parameters:
 *   cpu_no      - Must be 0 until SMP is implemented
 *   intr_source - External Irq number
 *   intr_num    - CPU Irq number
 *   intr_prio   - Priority of the interrupt, ignored at the moment
 *
 ****************************************************************************/

void __wrap_intr_matrix_set(s32 cpu_no, u32 intr_source,
                          u32 intr_num, s32 intr_prio)
{
    LT_UNUSED(intr_prio);
    LTLOG_DEBUG("wrap_intr_matrix_set", "cpu_no=%lu, intr_source=%lu, intr_num=%lu, intr_prio=%lx\n",
                LT_Pu32(cpu_no), LT_Pu32(intr_source), LT_Pu32(intr_num), LT_Pu32(intr_prio));
    if (!lt_map_external_irq(cpu_no, intr_source, intr_num)) {
        LTLOG_REDALERT("set.intr.fatal", "Unexpected interrupt configuration");
    }
}

/****************************************************************************
 * Name: LTEsp32OSAdapter_GetPrimitives
 *
 * Description:
 *   Publish the LT-backed OS primitives so a per-chip BLE driver can assemble
 *   its own osi_funcs_t table.  See Esp32_LTOSAdapterOsi.h.
 *
 ****************************************************************************/

static const Esp32OSAdapterPrimitives s_osAdapterPrimitives = {
    .SemCreate              = &lt_sem_create,
    .SemDelete              = &lt_sem_delete,
    .SemTake                = &lt_sem_take,
    .SemGive                = &lt_sem_give,
    .SemTakeFromIsr         = &lt_sem_take_from_isr,
    .SemGiveFromIsr         = &lt_sem_give_from_isr,

    .InterruptDisable       = &interrupt_disable,
    .InterruptRestore       = &interrupt_restore,
    .TaskYield              = &lt_task_yield,
    .TaskYieldFromIsr       = &lt_task_yield_from_isr,

    .MutexCreate            = &lt_mutex_create,
    .MutexDelete            = &lt_mutex_delete,
    .MutexLock              = &lt_mutex_lock,
    .MutexUnlock            = &lt_mutex_unlock,

    .QueueCreate            = &lt_queue_create,
    .QueueDelete            = &lt_queue_delete,
    .QueueSend              = &lt_queue_send,
    .QueueSendFromIsr       = &lt_queue_send_from_isr,
    .QueueRecv              = &lt_queue_recv,
    .QueueRecvFromIsr       = &queue_recv_from_isr_wrapper,

    .TaskCreatePinnedToCore = &lt_task_create_pinned_to_core,
    .TaskDelete             = &lt_task_delete,
    .IsInIsr                = &is_in_isr_wrapper,

    .Malloc                 = &esp_malloc,
    .MallocInternal         = &lt_malloc_internal,
    .Free                   = &esp_free,

    .ReadEfuseMac           = &read_mac_wrapper,
    .Srand                  = &srand_wrapper,
    .Rand                   = &lt_rand_stub,

    .TimerArm               = &lt_timer_arm,
    .TimerArmUs             = &lt_timer_arm_us,
    .TimerDisarm            = &lt_timer_disarm,
    .TimerDone              = &lt_timer_done,
    .TimerSetFn             = &lt_timer_setfn,
};

const Esp32OSAdapterPrimitives *LTEsp32OSAdapter_GetPrimitives(void) {
    return &s_osAdapterPrimitives;
}
